*** src/automaton/mutable_matcher.rs:1087:63: replace != with == in no_array_trail_conflict

*** mutation diff:
--- src/automaton/mutable_matcher.rs
+++ replace != with == in no_array_trail_conflict
@@ -1079,17 +1079,17 @@
     }
     true
 }
 
 /// Check if two array trails have no conflicts
 fn no_array_trail_conflict(from: &[crate::json::ArrayPos], to: &[crate::json::ArrayPos]) -> bool {
     for from_pos in from {
         for to_pos in to {
-            if from_pos.array == to_pos.array && from_pos.pos != to_pos.pos {
+            if from_pos.array == to_pos.array && from_pos.pos == /* ~ changed by cargo-mutants ~ */ to_pos.pos {
                 return false;
             }
         }
     }
     true
 }
 
 /// A set of matches (deduplicated)

---- automaton::mutable_matcher::tests::test_core_matcher_array_trail_conflict stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_array_trail_conflict' (835013) panicked at src/automaton/mutable_matcher.rs:2111:9:
assertion failed: cm.matches_for_fields(&conflicting).is_empty()

failures:
    automaton::mutable_matcher::tests::test_core_matcher_array_trail_conflict

test result: FAILED. 605 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.51s

*** result: Failure(101)
