*** src/automaton/mutable_matcher.rs:1110:12: delete ! in MatchSet<X>::add

*** mutation diff:
--- src/automaton/mutable_matcher.rs
+++ delete ! in MatchSet<X>::add
@@ -1102,17 +1102,17 @@
     fn new() -> Self {
         Self {
             seen: HashSet::new(),
             matches: Vec::new(),
         }
     }
 
     fn add(&mut self, x: X) {
-        if !self.seen.contains(&x) {
+        if  /* ~ changed by cargo-mutants ~ */self.seen.contains(&x) {
             self.seen.insert(x.clone());
             self.matches.push(x);
         }
     }
 
     fn into_vec(self) -> Vec<X> {
         self.matches
     }

---- automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict' (842027) panicked at src/automaton/mutable_matcher.rs:2351:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_arena_migration_core_matcher_all_types stdout ----

thread 'automaton::mutable_matcher::tests::test_arena_migration_core_matcher_all_types' (842014) panicked at src/automaton/mutable_matcher.rs:2016:9:
assertion failed: matches.contains(&"exact".to_string())

---- automaton::mutable_matcher::tests::test_core_matcher_direct_exists_false stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_exists_false' (842028) panicked at src/automaton/mutable_matcher.rs:2499:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

failures:
    automaton::mutable_matcher::tests::test_arena_migration_core_matcher_all_types
    automaton::mutable_matcher::tests::test_core_matcher_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_direct_exists_false
    automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_multi_field_owned
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_direct
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_owned
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_ref
    automaton::mutable_matcher::tests::test_core_matcher_ref_array_trail_conflict
    automaton::mutable

test result: FAILED. 584 passed; 22 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.71s

*** result: Failure(101)
