*** src/automaton/mutable_matcher.rs:1110:9: replace MatchSet<X>::add with ()

*** mutation diff:
--- src/automaton/mutable_matcher.rs
+++ replace MatchSet<X>::add with ()
@@ -1102,20 +1102,17 @@
     fn new() -> Self {
         Self {
             seen: HashSet::new(),
             matches: Vec::new(),
         }
     }
 
     fn add(&mut self, x: X) {
-        if !self.seen.contains(&x) {
-            self.seen.insert(x.clone());
-            self.matches.push(x);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn into_vec(self) -> Vec<X> {
         self.matches
     }
 }
 
 /// Core matcher that uses automaton-based matching for multiple fields.

---- automaton::mutable_matcher::tests::test_core_matcher_multi_field_owned stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_multi_field_owned' (836702) panicked at src/automaton/mutable_matcher.rs:2147:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_no_self_match_direct stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_no_self_match_direct' (836703) panicked at src/automaton/mutable_matcher.rs:2477:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_direct_exists_false stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_exists_false' (836699) panicked at src/automaton/mutable_matcher.rs:2496:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

failures:
    automaton::mutable_matcher::tests::test_arena_migration_core_matcher_all_types
    automaton::mutable_matcher::tests::test_core_matcher_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_direct_exists_false
    automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_multi_field_owned
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_direct
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_owned
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_ref
    automaton::mutable_matcher::tests::test_core_matcher_ref_array_trail_conflict
    automaton::mutable

test result: FAILED. 584 passed; 22 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.39s

*** result: Failure(101)
