*** src/automaton/mutable_matcher.rs:1117:9: replace MatchSet<X>::into_vec -> Vec<X> with vec![]

*** mutation diff:
--- src/automaton/mutable_matcher.rs
+++ replace MatchSet<X>::into_vec -> Vec<X> with vec![]
@@ -1109,17 +1109,17 @@
     fn add(&mut self, x: X) {
         if !self.seen.contains(&x) {
             self.seen.insert(x.clone());
             self.matches.push(x);
         }
     }
 
     fn into_vec(self) -> Vec<X> {
-        self.matches
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Core matcher that uses automaton-based matching for multiple fields.
 ///
 /// This implements the Go quamina matching algorithm:
 /// 1. Patterns are added by building a graph of FieldMatcher -> MutableValueMatcher -> FieldMatcher
 /// 2. Event fields are sorted and matched against the automaton

---- automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field' (844488) panicked at src/automaton/mutable_matcher.rs:2288:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_array_trail_conflict stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_array_trail_conflict' (844485) panicked at src/automaton/mutable_matcher.rs:2128:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict' (844486) panicked at src/automaton/mutable_matcher.rs:2351:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

failures:
    automaton::mutable_matcher::tests::test_arena_migration_core_matcher_all_types
    automaton::mutable_matcher::tests::test_core_matcher_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_direct_exists_false
    automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_multi_field_owned
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_direct
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_owned
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_ref
    automaton::mutable_matcher::tests::test_core_matcher_ref_array_trail_conflict
    automaton::mutable

test result: FAILED. 584 passed; 22 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.55s

*** result: Failure(101)
