*** src/automaton/mutable_matcher.rs:1226:9: replace CoreMatcher<X>::try_to_match with ()

*** mutation diff:
--- src/automaton/mutable_matcher.rs
+++ replace CoreMatcher<X>::try_to_match with ()
@@ -1218,57 +1218,17 @@
     fn try_to_match(
         &self,
         fields: &[EventField],
         index: usize,
         state: &Rc<MutableFieldMatcher<X>>,
         matches: &mut MatchSet<X>,
         bufs: &mut NfaBuffers,
     ) {
-        let field = &fields[index];
-
-        // Check exists:true transition
-        if let Some(exists_trans) = state.exists_true.borrow().get(&field.path) {
-            // Add matches from this state
-            for m in exists_trans.matches.borrow().iter() {
-                matches.add(m.clone());
-            }
-            // Try subsequent fields
-            for next_idx in (index + 1)..fields.len() {
-                if no_array_trail_conflict(&field.array_trail, &fields[next_idx].array_trail) {
-                    self.try_to_match(fields, next_idx, exists_trans, matches, bufs);
-                }
-            }
-            // Check exists:false at end
-            self.check_exists_false(state, fields, index, matches, bufs);
-        }
-
-        // Check exists:false (field doesn't exist)
-        self.check_exists_false(state, fields, index, matches, bufs);
-
-        // Try value transitions
-        let next_states =
-            state.transition_on(&field.path, field.value.as_bytes(), field.is_number, bufs);
-
-        for next_state in next_states {
-            // Add matches from next state
-            for m in next_state.matches.borrow().iter() {
-                matches.add(m.clone());
-            }
-
-            // Try subsequent fields
-            for next_idx in (index + 1)..fields.len() {
-                if no_array_trail_conflict(&field.array_trail, &fields[next_idx].array_trail) {
-                    self.try_to_match(fields, next_idx, &next_state, matches, bufs);
-                }
-            }
-
-            // Check exists:false at end
-            self.check_exists_false(&next_state, fields, index, matches, bufs);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check exists:false patterns - field must NOT exist
     fn check_exists_false(
         &self,
         state: &Rc<MutableFieldMatcher<X>>,
         fields: &[EventField],
         index: usize,

---- automaton::mutable_matcher::tests::test_core_matcher_array_trail_conflict stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_array_trail_conflict' (851380) panicked at src/automaton/mutable_matcher.rs:2088:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_arena_migration_core_matcher_all_types stdout ----

thread 'automaton::mutable_matcher::tests::test_arena_migration_core_matcher_all_types' (851368) panicked at src/automaton/mutable_matcher.rs:1976:9:
assertion failed: matches.contains(&"exact".to_string())

---- automaton::mutable_matcher::tests::test_core_matcher_multi_field_owned stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_multi_field_owned' (851388) panicked at src/automaton/mutable_matcher.rs:2110:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

failures:
    automaton::mutable_matcher::tests::test_arena_migration_core_matcher_all_types
    automaton::mutable_matcher::tests::test_core_matcher_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_multi_field_owned
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_owned
    automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp
    automaton::tests::test_arena_nfa_bufs_clear_observable_through_matching
    automaton::tests::test_core_matcher_exists_false
    automaton::tests::test_core_matcher_exists_true
    automaton::tests::test_core_matcher_multi_field_and
    automaton::tests::test_core_matcher_multiple_patterns
    automaton::tests::test_core_matcher_or_within_field
    automaton::tests::test_core_matcher_single_field_exact

test result: FAILED. 594 passed; 12 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.68s

*** result: Failure(101)
