*** src/automaton/mutable_matcher.rs:1235:36: replace + with * in CoreMatcher<X>::try_to_match

*** mutation diff:
--- src/automaton/mutable_matcher.rs
+++ replace + with * in CoreMatcher<X>::try_to_match
@@ -1227,17 +1227,17 @@
 
         // Check exists:true transition
         if let Some(exists_trans) = state.exists_true.borrow().get(&field.path) {
             // Add matches from this state
             for m in exists_trans.matches.borrow().iter() {
                 matches.add(m.clone());
             }
             // Try subsequent fields
-            for next_idx in (index + 1)..fields.len() {
+            for next_idx in (index * /* ~ changed by cargo-mutants ~ */ 1)..fields.len() {
                 if no_array_trail_conflict(&field.array_trail, &fields[next_idx].array_trail) {
                     self.try_to_match(fields, next_idx, exists_trans, matches, bufs);
                 }
             }
             // Check exists:false at end
             self.check_exists_false(state, fields, index, matches, bufs);
         }

*** result: Success
