*** src/automaton/mutable_matcher.rs:1336:9: replace CoreMatcher<X>::try_to_match_ref with ()

*** mutation diff:
--- src/automaton/mutable_matcher.rs
+++ replace CoreMatcher<X>::try_to_match_ref with ()
@@ -1328,50 +1328,17 @@
     fn try_to_match_ref(
         &self,
         fields: &[EventFieldRef<'_>],
         index: usize,
         state: &Rc<MutableFieldMatcher<X>>,
         matches: &mut MatchSet<X>,
         bufs: &mut NfaBuffers,
     ) {
-        let field = &fields[index];
-
-        // Check exists:true transition
-        if let Some(exists_trans) = state.exists_true.borrow().get(field.path) {
-            for m in exists_trans.matches.borrow().iter() {
-                matches.add(m.clone());
-            }
-            for next_idx in (index + 1)..fields.len() {
-                if no_array_trail_conflict_ref(field.array_trail, fields[next_idx].array_trail) {
-                    self.try_to_match_ref(fields, next_idx, exists_trans, matches, bufs);
-                }
-            }
-            self.check_exists_false_ref(state, fields, index, matches, bufs);
-        }
-
-        // Check exists:false
-        self.check_exists_false_ref(state, fields, index, matches, bufs);
-
-        // Try value transitions
-        let next_states = state.transition_on(field.path, field.value, field.is_number, bufs);
-
-        for next_state in next_states {
-            for m in next_state.matches.borrow().iter() {
-                matches.add(m.clone());
-            }
-
-            for next_idx in (index + 1)..fields.len() {
-                if no_array_trail_conflict_ref(field.array_trail, fields[next_idx].array_trail) {
-                    self.try_to_match_ref(fields, next_idx, &next_state, matches, bufs);
-                }
-            }
-
-            self.check_exists_false_ref(&next_state, fields, index, matches, bufs);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check exists:false patterns (zero-copy version)
     fn check_exists_false_ref(
         &self,
         state: &Rc<MutableFieldMatcher<X>>,
         fields: &[EventFieldRef<'_>],
         index: usize,

---- automaton::mutable_matcher::tests::test_core_matcher_ref_exists_false stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_ref_exists_false' (877219) panicked at src/automaton/mutable_matcher.rs:2221:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_ref_multi_field stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_ref_multi_field' (877220) panicked at src/automaton/mutable_matcher.rs:2150:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_no_self_match_ref stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_no_self_match_ref' (877217) panicked at src/automaton/mutable_matcher.rs:2410:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

failures:
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_ref
    automaton::mutable_matcher::tests::test_core_matcher_ref_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_ref_exists_false
    automaton::mutable_matcher::tests::test_core_matcher_ref_multi_field

test result: FAILED. 602 passed; 4 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.44s

*** result: Failure(101)
