*** src/automaton/mutable_matcher.rs:1362:36: replace + with - in CoreMatcher<X>::try_to_match_ref

*** mutation diff:
--- src/automaton/mutable_matcher.rs
+++ replace + with - in CoreMatcher<X>::try_to_match_ref
@@ -1354,17 +1354,17 @@
         // Try value transitions
         let next_states = state.transition_on(field.path, field.value, field.is_number, bufs);
 
         for next_state in next_states {
             for m in next_state.matches.borrow().iter() {
                 matches.add(m.clone());
             }
 
-            for next_idx in (index + 1)..fields.len() {
+            for next_idx in (index - /* ~ changed by cargo-mutants ~ */ 1)..fields.len() {
                 if no_array_trail_conflict_ref(field.array_trail, fields[next_idx].array_trail) {
                     self.try_to_match_ref(fields, next_idx, &next_state, matches, bufs);
                 }
             }
 
             self.check_exists_false_ref(&next_state, fields, index, matches, bufs);
         }
     }

---- automaton::mutable_matcher::tests::test_core_matcher_ref_multi_field stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_ref_multi_field' (891374) panicked at src/automaton/mutable_matcher.rs:1362:29:
attempt to subtract with overflow

---- automaton::mutable_matcher::tests::test_core_matcher_no_self_match_ref stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_no_self_match_ref' (891371) panicked at src/automaton/mutable_matcher.rs:1362:29:
attempt to subtract with overflow

---- automaton::mutable_matcher::tests::test_core_matcher_ref_array_trail_conflict stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_ref_array_trail_conflict' (891372) panicked at src/automaton/mutable_matcher.rs:1362:29:
attempt to subtract with overflow

failures:
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_ref
    automaton::mutable_matcher::tests::test_core_matcher_ref_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_ref_multi_field

test result: FAILED. 603 passed; 3 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.34s

*** result: Failure(101)
