*** src/automaton/mutable_matcher.rs:1480:16: delete ! in CoreMatcher<X>::check_exists_false_direct

*** mutation diff:
--- src/automaton/mutable_matcher.rs
+++ delete ! in CoreMatcher<X>::check_exists_false_direct
@@ -1472,17 +1472,17 @@
         matches: &mut MatchSet<X>,
         bufs: &mut NfaBuffers,
     ) {
         for (path, exists_trans) in state.exists_false.borrow().iter() {
             let field_exists = fields
                 .binary_search_by(|f| f.path.as_ref().cmp(path.as_bytes()))
                 .is_ok();
 
-            if !field_exists {
+            if  /* ~ changed by cargo-mutants ~ */field_exists {
                 for m in exists_trans.matches.borrow().iter() {
                     matches.add(m.clone());
                 }
                 self.try_to_match_direct(fields, index, exists_trans, matches, bufs);
             }
         }
     }
 }

---- automaton::mutable_matcher::tests::test_core_matcher_direct_exists_false stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_exists_false' (933039) panicked at src/automaton/mutable_matcher.rs:2499:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_exists_false

test result: FAILED. 605 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.40s

*** result: Failure(101)
