*** src/flatten_json.rs:104:9: replace FieldValue<'_>::as_bytes -> &[u8] with Vec::leak(vec![0])

*** mutation diff:
--- src/flatten_json.rs
+++ replace FieldValue<'_>::as_bytes -> &[u8] with Vec::leak(vec![0])
@@ -96,20 +96,17 @@
             MemberName::Borrowed(b) => b,
             MemberName::Owned(v) => v.as_slice(),
         }
     }
 }
 
 impl FieldValue<'_> {
     pub fn as_bytes(&self) -> &[u8] {
-        match self {
-            FieldValue::Borrowed(s) => s,
-            FieldValue::Owned(v) => v,
-        }
+        Vec::leak(vec![0]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Reusable JSON flattener state.
 ///
 /// This struct holds the working buffers that can be reused across multiple
 /// flatten calls, following Go's reset() pattern for reduced allocations.
 /// Like Go's flattenJSON, we reuse the fields slice between calls to avoid

---- automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field' (3236035) panicked at src/automaton/mutable_matcher.rs:2290:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_exists_true_no_self_match_direct stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_exists_true_no_self_match_direct' (3236037) panicked at src/automaton/mutable_matcher.rs:2586:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict' (3236033) panicked at src/automaton/mutable_matcher.rs:2348:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_exists_true_no_self_match_direct
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_direct
    automaton::thread_safe::tests::test_tsm_exists_true_no_self_match_direct
    automaton::thread_safe::tests::test_tsm_multi_field_direct
    automaton::thread_safe::tests::test_tsm_no_self_match_direct
    flatten_json::tests::test_escape_sequences
    flatten_json::tests::test_nested_object
    flatten_json::tests::test_number_value
    flatten_json::tests::test_simple_object

test result: FAILED. 434 passed; 216 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.08s

*** result: Failure(101)
