*** src/flatten_json.rs:165:9: replace FlattenJsonState::flatten -> Result<&mut[Field<'a>], QuaminaError> with Ok(Vec::leak(Vec::new()))

*** mutation diff:
--- src/flatten_json.rs
+++ replace FlattenJsonState::flatten -> Result<&mut[Field<'a>], QuaminaError> with Ok(Vec::leak(Vec::new()))
@@ -157,39 +157,17 @@
     ///
     /// This is the primary API for high-performance event processing.
     /// The state is automatically reset before each call.
     pub fn flatten<'a>(
         &mut self,
         event: &'a [u8],
         tree: &SegmentsTree,
     ) -> Result<&mut [Field<'a>], QuaminaError> {
-        self.reset();
-
-        let mut ctx = FlattenContext {
-            event,
-            index: 0,
-            fields: &mut self.fields,
-            skipping: 0,
-            array_trail: &mut self.array_trail,
-            array_count: 0,
-        };
-
-        ctx.flatten_impl(tree)?;
-
-        // SAFETY: The Fields in self.fields contain borrows from `event` which has lifetime 'a.
-        // We store them with 'static lifetime internally, but return a slice with the correct
-        // 'a lifetime. This is safe because:
-        // 1. We cleared the vec at the start, so all borrows are from this event
-        // 2. The returned mutable slice borrows self, preventing concurrent flatten calls
-        // 3. The caller cannot use the slice after event is dropped (enforced by 'a)
-        let fields_slice: &mut [Field<'a>] =
-            unsafe { std::mem::transmute(self.fields.as_mut_slice()) };
-
-        Ok(fields_slice)
+        Ok(Vec::leak(Vec::new())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Internal context for a single flatten operation.
 /// Borrows the reusable fields vec and array_trail from FlattenJsonState.
 struct FlattenContext<'a, 'b> {
     event: &'a [u8],
     index: usize,

---- flatten_json::tests::test_early_termination stdout ----

thread 'flatten_json::tests::test_early_termination' (3247957) panicked at src/flatten_json.rs:1120:9:
assertion `left == right` failed
  left: 0
 right: 1

---- flatten_json::tests::test_error_skipping_never_ending_string stdout ----

thread 'flatten_json::tests::test_error_skipping_never_ending_string' (3247962) panicked at src/flatten_json.rs:1328:13:
Should reject never-ending string: { "a": { "v": "hello

---- flatten_json::tests::test_error_invalid_nested_object stdout ----

thread 'flatten_json::tests::test_error_invalid_nested_object' (3247960) panicked at src/flatten_json.rs:1303:9:
Should reject invalid nested object: {"a": { x }}

failures:
    flatten_json::tests::test_array_simple
    flatten_json::tests::test_early_termination
    flatten_json::tests::test_error_invalid_json_structure
    flatten_json::tests::test_error_invalid_nested_object
    flatten_json::tests::test_error_invalid_value
    flatten_json::tests::test_error_skipping_never_ending_string
    flatten_json::tests::test_error_truncated_array
    flatten_json::tests::test_error_truncated_object
    flatten_json::tests::test_error_truncated_string
    flatten_json::tests::test_escape_sequences
    flatten_json::tests::test_nested_object
    flatten_json::tests::test_number_value

test result: FAILED. 428 passed; 222 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.65s

*** result: Failure(101)
