*** src/flatten_json.rs:211:9: replace FlattenContext<'a, '_>::push_field with ()

*** mutation diff:
--- src/flatten_json.rs
+++ replace FlattenContext<'a, '_>::push_field with ()
@@ -203,18 +203,17 @@
 
 impl<'a> FlattenContext<'a, '_> {
     /// Push a field to the storage, transmuting the lifetime.
     #[inline]
     fn push_field(&mut self, field: Field<'a>) {
         // SAFETY: Field<'a> and Field<'static> have the same layout.
         // The actual borrows are from self.event, and the caller will
         // receive a slice with the correct 'a lifetime.
-        let static_field: Field<'static> = unsafe { std::mem::transmute(field) };
-        self.fields.push(static_field);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<'a> FlattenContext<'a, '_> {
     fn flatten_impl(&mut self, tree: &SegmentsTree) -> Result<(), QuaminaError> {
         if self.event.is_empty() {
             return Err(QuaminaError::InvalidJson("empty event".into()));
         }

---- flatten_json::tests::test_array_simple stdout ----

thread 'flatten_json::tests::test_array_simple' (3251842) panicked at src/flatten_json.rs:1126:9:
assertion `left == right` failed
  left: 0
 right: 3

---- flatten_json::tests::test_early_termination stdout ----

thread 'flatten_json::tests::test_early_termination' (3251843) panicked at src/flatten_json.rs:1141:9:
assertion `left == right` failed
  left: 0
 right: 1

---- flatten_json::tests::test_escape_sequences stdout ----

thread 'flatten_json::tests::test_escape_sequences' (3251852) panicked at src/flatten_json.rs:1152:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    flatten_json::tests::test_array_simple
    flatten_json::tests::test_early_termination
    flatten_json::tests::test_escape_sequences
    flatten_json::tests::test_nested_object
    flatten_json::tests::test_number_value
    flatten_json::tests::test_simple_object
    flatten_json::tests::test_skip_array
    flatten_json::tests::test_skip_nested_object
    flatten_json::tests::test_skips_unused_fields
    flatten_json::tests::test_state_reuse
    flatten_json::tests::test_unicode_escape
    tests_core::test_and_across_fields

test result: FAILED. 437 passed; 213 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.96s

*** result: Failure(101)
