*** src/flatten_json.rs:218:9: replace FlattenContext<'a, '_>::flatten_impl -> Result<(), QuaminaError> with Ok(())

*** mutation diff:
--- src/flatten_json.rs
+++ replace FlattenContext<'a, '_>::flatten_impl -> Result<(), QuaminaError> with Ok(())
@@ -210,51 +210,17 @@
         // receive a slice with the correct 'a lifetime.
         let static_field: Field<'static> = unsafe { std::mem::transmute(field) };
         self.fields.push(static_field);
     }
 }
 
 impl<'a> FlattenContext<'a, '_> {
     fn flatten_impl(&mut self, tree: &SegmentsTree) -> Result<(), QuaminaError> {
-        if self.event.is_empty() {
-            return Err(QuaminaError::InvalidJson("empty event".into()));
-        }
-
-        // Find the opening brace
-        loop {
-            let ch = self.ch();
-            if ch == b'{' {
-                match self.read_object(tree) {
-                    Ok(()) => {}
-                    Err(FlattenError::EarlyStop) => return Ok(()),
-                    Err(FlattenError::Error(e)) => return Err(e),
-                }
-                // Eat trailing whitespace
-                self.index += 1;
-                while self.index < self.event.len() {
-                    let ch = self.event[self.index];
-                    if !is_whitespace(ch) {
-                        return Err(self.error(&format!(
-                            "garbage char '{}' after top-level object",
-                            ch as char
-                        )));
-                    }
-                    self.index += 1;
-                }
-                return Ok(());
-            } else if is_whitespace(ch) {
-                self.index += 1;
-                if self.index >= self.event.len() {
-                    return Err(self.error("unexpected end of event"));
-                }
-            } else {
-                return Err(self.error("not a JSON object"));
-            }
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read a JSON object, recursing into nested objects as needed.
     fn read_object(&mut self, tree: &SegmentsTree) -> Result<(), FlattenError> {
         // index points at {
         self.step()?;
 
         let mut fields_count = tree.fields_count();

---- flatten_json::tests::test_error_skipping_never_ending_string stdout ----

thread 'flatten_json::tests::test_error_skipping_never_ending_string' (3255665) panicked at src/flatten_json.rs:1316:13:
Should reject never-ending string: { "a": { "v": "hello

---- flatten_json::tests::test_early_termination stdout ----

thread 'flatten_json::tests::test_early_termination' (3255660) panicked at src/flatten_json.rs:1108:9:
assertion `left == right` failed
  left: 0
 right: 1

---- flatten_json::tests::test_error_invalid_json_structure stdout ----

thread 'flatten_json::tests::test_error_invalid_json_structure' (3255662) panicked at src/flatten_json.rs:1278:13:
Should reject invalid structure: "xx"

failures:
    flatten_json::tests::test_array_simple
    flatten_json::tests::test_early_termination
    flatten_json::tests::test_error_invalid_json_structure
    flatten_json::tests::test_error_invalid_nested_object
    flatten_json::tests::test_error_invalid_value
    flatten_json::tests::test_error_skipping_never_ending_string
    flatten_json::tests::test_error_truncated_array
    flatten_json::tests::test_error_truncated_object
    flatten_json::tests::test_error_truncated_string
    flatten_json::tests::test_escape_sequences
    flatten_json::tests::test_nested_object
    flatten_json::tests::test_number_value

test result: FAILED. 428 passed; 222 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.65s

*** result: Failure(101)
