*** src/flatten_json.rs:225:19: replace == with != in FlattenContext<'a, '_>::flatten_impl

*** mutation diff:
--- src/flatten_json.rs
+++ replace == with != in FlattenContext<'a, '_>::flatten_impl
@@ -217,17 +217,17 @@
     fn flatten_impl(&mut self, tree: &SegmentsTree) -> Result<(), QuaminaError> {
         if self.event.is_empty() {
             return Err(QuaminaError::InvalidJson("empty event".into()));
         }
 
         // Find the opening brace
         loop {
             let ch = self.ch();
-            if ch == b'{' {
+            if ch != /* ~ changed by cargo-mutants ~ */ b'{' {
                 match self.read_object(tree) {
                     Ok(()) => {}
                     Err(FlattenError::EarlyStop) => return Ok(()),
                     Err(FlattenError::Error(e)) => return Err(e),
                 }
                 // Eat trailing whitespace
                 self.index += 1;
                 while self.index < self.event.len() {

---- flatten_json::tests::test_array_simple stdout ----

thread 'flatten_json::tests::test_array_simple' (3259479) panicked at src/flatten_json.rs:1125:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 0: not a JSON object")

---- flatten_json::tests::test_empty_object stdout ----

thread 'flatten_json::tests::test_empty_object' (3259481) panicked at src/flatten_json.rs:1174:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 0: not a JSON object")

---- flatten_json::tests::test_early_termination stdout ----

thread 'flatten_json::tests::test_early_termination' (3259480) panicked at src/flatten_json.rs:1140:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 0: not a JSON object")

failures:
    flatten_json::tests::test_array_simple
    flatten_json::tests::test_early_termination
    flatten_json::tests::test_empty_object
    flatten_json::tests::test_escape_sequences
    flatten_json::tests::test_nested_object
    flatten_json::tests::test_number_value
    flatten_json::tests::test_simple_object
    flatten_json::tests::test_skip_array
    flatten_json::tests::test_skip_nested_object
    flatten_json::tests::test_skips_unused_fields
    flatten_json::tests::test_state_reuse
    flatten_json::tests::test_unicode_escape

test result: FAILED. 421 passed; 229 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.51s

*** result: Failure(101)
