*** src/flatten_json.rs:232:28: replace += with *= in FlattenContext<'a, '_>::flatten_impl

*** mutation diff:
--- src/flatten_json.rs
+++ replace += with *= in FlattenContext<'a, '_>::flatten_impl
@@ -224,17 +224,17 @@
             let ch = self.ch();
             if ch == b'{' {
                 match self.read_object(tree) {
                     Ok(()) => {}
                     Err(FlattenError::EarlyStop) => return Ok(()),
                     Err(FlattenError::Error(e)) => return Err(e),
                 }
                 // Eat trailing whitespace
-                self.index += 1;
+                self.index *= /* ~ changed by cargo-mutants ~ */ 1;
                 while self.index < self.event.len() {
                     let ch = self.event[self.index];
                     if !is_whitespace(ch) {
                         return Err(self.error(&format!(
                             "garbage char '{}' after top-level object",
                             ch as char
                         )));
                     }

---- flatten_json::tests::test_array_simple stdout ----

thread 'flatten_json::tests::test_array_simple' (3266262) panicked at src/flatten_json.rs:1125:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 24: garbage char '}' after top-level object")

---- flatten_json::tests::test_empty_object stdout ----

thread 'flatten_json::tests::test_empty_object' (3266264) panicked at src/flatten_json.rs:1174:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 1: garbage char '}' after top-level object")

---- tests_core::test_and_across_fields stdout ----

thread 'tests_core::test_and_across_fields' (3266406) panicked at src/tests_core.rs:279:5:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 37: garbage char '}' after top-level object")

failures:
    flatten_json::tests::test_array_simple
    flatten_json::tests::test_empty_object
    tests_core::test_and_across_fields
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_array_cross_element_matching
    tests_core::test_array_element_matching
    tests_core::test_delete_multi_pattern_id_removes_all
    tests_core::test_exists_false
    tests_core::test_exists_true
    tests_core::test_exists_with_empty_array
    tests_core::test_field_name_ordering_with_exists
    tests_core::test_mixed_number_and_string_in_same_value_array

test result: FAILED. 629 passed; 21 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.15s

*** result: Failure(101)
