*** src/flatten_json.rs:233:34: replace < with == in FlattenContext<'a, '_>::flatten_impl

*** mutation diff:
--- src/flatten_json.rs
+++ replace < with == in FlattenContext<'a, '_>::flatten_impl
@@ -225,17 +225,17 @@
             if ch == b'{' {
                 match self.read_object(tree) {
                     Ok(()) => {}
                     Err(FlattenError::EarlyStop) => return Ok(()),
                     Err(FlattenError::Error(e)) => return Err(e),
                 }
                 // Eat trailing whitespace
                 self.index += 1;
-                while self.index < self.event.len() {
+                while self.index == /* ~ changed by cargo-mutants ~ */ self.event.len() {
                     let ch = self.event[self.index];
                     if !is_whitespace(ch) {
                         return Err(self.error(&format!(
                             "garbage char '{}' after top-level object",
                             ch as char
                         )));
                     }
                     self.index += 1;

---- flatten_json::tests::test_array_simple stdout ----

thread 'flatten_json::tests::test_array_simple' (3270085) panicked at src/flatten_json.rs:234:30:
index out of bounds: the len is 25 but the index is 25

---- flatten_json::tests::test_empty_object stdout ----

thread 'flatten_json::tests::test_empty_object' (3270087) panicked at src/flatten_json.rs:234:30:
index out of bounds: the len is 2 but the index is 2

---- tests_core::test_and_across_fields stdout ----

thread 'tests_core::test_and_across_fields' (3270229) panicked at src/flatten_json.rs:234:30:
index out of bounds: the len is 38 but the index is 38

failures:
    flatten_json::tests::test_array_simple
    flatten_json::tests::test_empty_object
    tests_core::test_and_across_fields
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_array_cross_element_matching
    tests_core::test_array_element_matching
    tests_core::test_delete_multi_pattern_id_removes_all
    tests_core::test_exists_false
    tests_core::test_exists_true
    tests_core::test_exists_with_empty_array
    tests_core::test_field_name_ordering_with_exists
    tests_core::test_mixed_number_and_string_in_same_value_array

test result: FAILED. 628 passed; 22 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.10s

*** result: Failure(101)
