*** src/flatten_json.rs:233:34: replace < with > in FlattenContext<'a, '_>::flatten_impl

*** mutation diff:
--- src/flatten_json.rs
+++ replace < with > in FlattenContext<'a, '_>::flatten_impl
@@ -225,17 +225,17 @@
             if ch == b'{' {
                 match self.read_object(tree) {
                     Ok(()) => {}
                     Err(FlattenError::EarlyStop) => return Ok(()),
                     Err(FlattenError::Error(e)) => return Err(e),
                 }
                 // Eat trailing whitespace
                 self.index += 1;
-                while self.index < self.event.len() {
+                while self.index > /* ~ changed by cargo-mutants ~ */ self.event.len() {
                     let ch = self.event[self.index];
                     if !is_whitespace(ch) {
                         return Err(self.error(&format!(
                             "garbage char '{}' after top-level object",
                             ch as char
                         )));
                     }
                     self.index += 1;

*** result: Success
