*** src/flatten_json.rs:235:24: delete ! in FlattenContext<'a, '_>::flatten_impl

*** mutation diff:
--- src/flatten_json.rs
+++ delete ! in FlattenContext<'a, '_>::flatten_impl
@@ -227,17 +227,17 @@
                     Ok(()) => {}
                     Err(FlattenError::EarlyStop) => return Ok(()),
                     Err(FlattenError::Error(e)) => return Err(e),
                 }
                 // Eat trailing whitespace
                 self.index += 1;
                 while self.index < self.event.len() {
                     let ch = self.event[self.index];
-                    if !is_whitespace(ch) {
+                    if  /* ~ changed by cargo-mutants ~ */is_whitespace(ch) {
                         return Err(self.error(&format!(
                             "garbage char '{}' after top-level object",
                             ch as char
                         )));
                     }
                     self.index += 1;
                 }
                 return Ok(());

*** result: Success
