*** src/flatten_json.rs:241:32: replace += with -= in FlattenContext<'a, '_>::flatten_impl

*** mutation diff:
--- src/flatten_json.rs
+++ replace += with -= in FlattenContext<'a, '_>::flatten_impl
@@ -233,17 +233,17 @@
                 while self.index < self.event.len() {
                     let ch = self.event[self.index];
                     if !is_whitespace(ch) {
                         return Err(self.error(&format!(
                             "garbage char '{}' after top-level object",
                             ch as char
                         )));
                     }
-                    self.index += 1;
+                    self.index -= /* ~ changed by cargo-mutants ~ */ 1;
                 }
                 return Ok(());
             } else if is_whitespace(ch) {
                 self.index += 1;
                 if self.index >= self.event.len() {
                     return Err(self.error("unexpected end of event"));
                 }
             } else {

*** result: Success
