*** src/flatten_json.rs:245:28: replace += with *= in FlattenContext<'a, '_>::flatten_impl

*** mutation diff:
--- src/flatten_json.rs
+++ replace += with *= in FlattenContext<'a, '_>::flatten_impl
@@ -237,17 +237,17 @@
                             "garbage char '{}' after top-level object",
                             ch as char
                         )));
                     }
                     self.index += 1;
                 }
                 return Ok(());
             } else if is_whitespace(ch) {
-                self.index += 1;
+                self.index *= /* ~ changed by cargo-mutants ~ */ 1;
                 if self.index >= self.event.len() {
                     return Err(self.error("unexpected end of event"));
                 }
             } else {
                 return Err(self.error("not a JSON object"));
             }
         }
     }

*** result: Success
