*** src/flatten_json.rs:246:31: replace >= with < in FlattenContext<'a, '_>::flatten_impl

*** mutation diff:
--- src/flatten_json.rs
+++ replace >= with < in FlattenContext<'a, '_>::flatten_impl
@@ -238,17 +238,17 @@
                             ch as char
                         )));
                     }
                     self.index += 1;
                 }
                 return Ok(());
             } else if is_whitespace(ch) {
                 self.index += 1;
-                if self.index >= self.event.len() {
+                if self.index < /* ~ changed by cargo-mutants ~ */ self.event.len() {
                     return Err(self.error("unexpected end of event"));
                 }
             } else {
                 return Err(self.error("not a JSON object"));
             }
         }
     }

*** result: Success
