*** src/flatten_json.rs:264:59: replace == with != in FlattenContext<'a, '_>::read_object

*** mutation diff:
--- src/flatten_json.rs
+++ replace == with != in FlattenContext<'a, '_>::read_object
@@ -256,17 +256,17 @@
     fn read_object(&mut self, tree: &SegmentsTree) -> Result<(), FlattenError> {
         // index points at {
         self.step()?;
 
         let mut fields_count = tree.fields_count();
         let mut nodes_count = tree.nodes_count();
 
         // Snapshot array trail for object member fields
-        let array_trail: ArrayTrailVec = if self.skipping == 0 {
+        let array_trail: ArrayTrailVec = if self.skipping != /* ~ changed by cargo-mutants ~ */ 0 {
             self.array_trail.clone()
         } else {
             ArrayTrailVec::new()
         };
 
         // These are written in ObjectState::InObject (when we read a `"key"`) and
         // consumed later in ObjectState::MemberValue (when we parse the value).
         // Rust can't prove the state-machine ordering, so we must initialize them

---- tests_core::test_array_cross_element_comprehensive stdout ----

thread 'tests_core::test_array_cross_element_comprehensive' (3312781) panicked at src/tests_core.rs:230:5:
assertion `left == right` failed: Expected 1 matches for {
        "bands": [
            {
                "name": "The Clash",
                "members": [
                    {"given": "Joe", "surname": "Strummer", "role": ["guitar", "vocals"]},
                    {"given": "Mick", "surname": "Jones", "role": ["guitar", "vocals"]},
                    {"given": "Paul", "surname": "Simonon", "role": ["bass"]},
                    {"given": "Topper", "surname": "Headon", "role": ["drums"]}
                ]
            },

---- tests_core::test_array_cross_element_matching stdout ----

thread 'tests_core::test_array_cross_element_matching' (3312782) panicked at src/tests_core.rs:193:5:
Should not match across different array elements (event: {"members": [
        {"given": "Joe", "surname": "Strummer"},
        {"given": "Mick", "surname": "Jones"}
    ]})

failures:
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_array_cross_element_matching

test result: FAILED. 648 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.98s

*** result: Failure(101)
