*** src/flatten_json.rs:283:28: replace == with != in FlattenContext<'a, '_>::read_object

*** mutation diff:
--- src/flatten_json.rs
+++ replace == with != in FlattenContext<'a, '_>::read_object
@@ -275,17 +275,17 @@
         let mut member_name: MemberName<'a> = MemberName::Borrowed(&[]);
         #[allow(unused_assignments)]
         let mut member_is_used = false;
         let mut member_entry: Option<&SegmentEntry> = None;
         let mut state = ObjectState::InObject;
 
         loop {
             // Early termination: all needed fields found
-            if nodes_count == 0 && fields_count == 0 {
+            if nodes_count != /* ~ changed by cargo-mutants ~ */ 0 && fields_count == 0 {
                 if tree.is_root() {
                     return Err(FlattenError::EarlyStop);
                 } else {
                     return self.leave_object();
                 }
             }
 
             let ch = self.ch();

---- flatten_json::tests::test_nested_object stdout ----

thread 'flatten_json::tests::test_nested_object' (3320357) panicked at src/flatten_json.rs:1091:9:
assertion `left == right` failed
  left: 0
 right: 1

---- tests_core::test_array_cross_element_comprehensive stdout ----

thread 'tests_core::test_array_cross_element_comprehensive' (3320497) panicked at src/tests_core.rs:230:5:
assertion `left == right` failed: Expected 1 matches for {
        "bands": [
            {
                "name": "The Clash",
                "members": [
                    {"given": "Joe", "surname": "Strummer", "role": ["guitar", "vocals"]},
                    {"given": "Mick", "surname": "Jones", "role": ["guitar", "vocals"]},
                    {"given": "Paul", "surname": "Simonon", "role": ["bass"]},
                    {"given": "Topper", "surname": "Headon", "role": ["drums"]}
                ]
            },

---- tests_core::test_deeply_nested stdout ----

thread 'tests_core::test_deeply_nested' (3320530) panicked at src/tests_core.rs:155:5:
assertion `left == right` failed: Event: {"a": {"b": {"c": "value"}}}
  left: []
 right: ["p1"]

failures:
    flatten_json::tests::test_nested_object
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_deeply_nested
    tests_core::test_nested_object_pattern
    tests_stress::test_concurrent_update_during_matching
    tests_stress::test_exercise_matching_comprehensive
    tests_stress::test_exercise_matching_miri_friendly

test result: FAILED. 643 passed; 7 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.72s

*** result: Failure(101)
