*** src/flatten_json.rs:283:33: replace && with || in FlattenContext<'a, '_>::read_object

*** mutation diff:
--- src/flatten_json.rs
+++ replace && with || in FlattenContext<'a, '_>::read_object
@@ -275,17 +275,17 @@
         let mut member_name: MemberName<'a> = MemberName::Borrowed(&[]);
         #[allow(unused_assignments)]
         let mut member_is_used = false;
         let mut member_entry: Option<&SegmentEntry> = None;
         let mut state = ObjectState::InObject;
 
         loop {
             // Early termination: all needed fields found
-            if nodes_count == 0 && fields_count == 0 {
+            if nodes_count == 0 || /* ~ changed by cargo-mutants ~ */ fields_count == 0 {
                 if tree.is_root() {
                     return Err(FlattenError::EarlyStop);
                 } else {
                     return self.leave_object();
                 }
             }
 
             let ch = self.ch();

---- flatten_json::tests::test_error_invalid_value stdout ----

thread 'flatten_json::tests::test_error_invalid_value' (3316475) panicked at src/flatten_json.rs:1295:13:
Should reject invalid value: {"a": xx}

---- flatten_json::tests::test_early_termination stdout ----

thread 'flatten_json::tests::test_early_termination' (3316471) panicked at src/flatten_json.rs:1142:9:
assertion `left == right` failed
  left: 0
 right: 1

---- flatten_json::tests::test_array_simple stdout ----

thread 'flatten_json::tests::test_array_simple' (3316470) panicked at src/flatten_json.rs:1127:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    flatten_json::tests::test_array_simple
    flatten_json::tests::test_early_termination
    flatten_json::tests::test_error_invalid_json_structure
    flatten_json::tests::test_error_invalid_nested_object
    flatten_json::tests::test_error_invalid_value
    flatten_json::tests::test_error_skipping_never_ending_string
    flatten_json::tests::test_error_truncated_array
    flatten_json::tests::test_error_truncated_object
    flatten_json::tests::test_error_truncated_string
    flatten_json::tests::test_escape_sequences
    flatten_json::tests::test_nested_object
    flatten_json::tests::test_number_value

test result: FAILED. 429 passed; 221 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.66s

*** result: Failure(101)
