*** src/flatten_json.rs:297:34: replace == with != in FlattenContext<'a, '_>::read_object

*** mutation diff:
--- src/flatten_json.rs
+++ replace == with != in FlattenContext<'a, '_>::read_object
@@ -289,17 +289,17 @@
             }
 
             let ch = self.ch();
 
             match state {
                 ObjectState::InObject => {
                     if is_whitespace(ch) {
                         // skip
-                    } else if ch == b'"' {
+                    } else if ch != /* ~ changed by cargo-mutants ~ */ b'"' {
                         member_name = self.read_member_name()?;
                         // Single fused lookup replaces separate is_segment_used + get + path_arc_for_segment
                         member_entry = if self.skipping == 0 {
                             tree.lookup(member_name.as_bytes())
                         } else {
                             None
                         };
                         member_is_used = member_entry.is_some();

---- flatten_json::tests::test_empty_object stdout ----

thread 'flatten_json::tests::test_empty_object' (3328304) panicked at src/flatten_json.rs:1174:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 2: premature end of event")

---- flatten_json::tests::test_array_simple stdout ----

thread 'flatten_json::tests::test_array_simple' (3328302) panicked at src/flatten_json.rs:1125:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 1: illegal character '\"' in JSON object")

---- flatten_json::tests::test_early_termination stdout ----

thread 'flatten_json::tests::test_early_termination' (3328303) panicked at src/flatten_json.rs:1140:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 1: illegal character '\"' in JSON object")

failures:
    flatten_json::tests::test_array_simple
    flatten_json::tests::test_early_termination
    flatten_json::tests::test_empty_object
    flatten_json::tests::test_escape_sequences
    flatten_json::tests::test_nested_object
    flatten_json::tests::test_number_value
    flatten_json::tests::test_simple_object
    flatten_json::tests::test_skip_array
    flatten_json::tests::test_skip_nested_object
    flatten_json::tests::test_skips_unused_fields
    flatten_json::tests::test_state_reuse
    flatten_json::tests::test_unicode_escape

test result: FAILED. 422 passed; 228 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.47s

*** result: Failure(101)
