*** src/flatten_json.rs:300:57: replace == with != in FlattenContext<'a, '_>::read_object

*** mutation diff:
--- src/flatten_json.rs
+++ replace == with != in FlattenContext<'a, '_>::read_object
@@ -292,17 +292,17 @@
 
             match state {
                 ObjectState::InObject => {
                     if is_whitespace(ch) {
                         // skip
                     } else if ch == b'"' {
                         member_name = self.read_member_name()?;
                         // Single fused lookup replaces separate is_segment_used + get + path_arc_for_segment
-                        member_entry = if self.skipping == 0 {
+                        member_entry = if self.skipping != /* ~ changed by cargo-mutants ~ */ 0 {
                             tree.lookup(member_name.as_bytes())
                         } else {
                             None
                         };
                         member_is_used = member_entry.is_some();
                         state = ObjectState::SeekingColon;
                     } else if ch == b'}' {
                         return Ok(());

---- flatten_json::tests::test_error_invalid_nested_object stdout ----

thread 'flatten_json::tests::test_error_invalid_nested_object' (3331289) panicked at src/flatten_json.rs:1325:9:
Should reject invalid nested object: {"a": { x }}

---- flatten_json::tests::test_early_termination stdout ----

thread 'flatten_json::tests::test_early_termination' (3331286) panicked at src/flatten_json.rs:1142:9:
assertion `left == right` failed
  left: 0
 right: 1

---- flatten_json::tests::test_error_invalid_json_structure stdout ----

thread 'flatten_json::tests::test_error_invalid_json_structure' (3331288) panicked at src/flatten_json.rs:1312:13:
Should reject invalid structure: {"a" : [ foo ]}

failures:
    flatten_json::tests::test_array_simple
    flatten_json::tests::test_early_termination
    flatten_json::tests::test_error_invalid_json_structure
    flatten_json::tests::test_error_invalid_nested_object
    flatten_json::tests::test_escape_sequences
    flatten_json::tests::test_nested_object
    flatten_json::tests::test_number_value
    flatten_json::tests::test_simple_object
    flatten_json::tests::test_skip_array
    flatten_json::tests::test_skip_nested_object
    flatten_json::tests::test_skips_unused_fields
    flatten_json::tests::test_state_reuse

test result: FAILED. 434 passed; 216 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.29s

*** result: Failure(101)
