*** src/flatten_json.rs:307:34: replace == with != in FlattenContext<'a, '_>::read_object

*** mutation diff:
--- src/flatten_json.rs
+++ replace == with != in FlattenContext<'a, '_>::read_object
@@ -299,17 +299,17 @@
                         // Single fused lookup replaces separate is_segment_used + get + path_arc_for_segment
                         member_entry = if self.skipping == 0 {
                             tree.lookup(member_name.as_bytes())
                         } else {
                             None
                         };
                         member_is_used = member_entry.is_some();
                         state = ObjectState::SeekingColon;
-                    } else if ch == b'}' {
+                    } else if ch != /* ~ changed by cargo-mutants ~ */ b'}' {
                         return Ok(());
                     } else {
                         return Err(FlattenError::Error(self.error(&format!(
                             "illegal character '{}' in JSON object",
                             ch as char
                         ))));
                     }
                 }

---- flatten_json::tests::test_empty_object stdout ----

thread 'flatten_json::tests::test_empty_object' (3335121) panicked at src/flatten_json.rs:1174:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 1: illegal character '}' in JSON object")

failures:
    flatten_json::tests::test_empty_object

test result: FAILED. 649 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.03s

*** result: Failure(101)
