*** src/flatten_json.rs:320:34: replace == with != in FlattenContext<'a, '_>::read_object

*** mutation diff:
--- src/flatten_json.rs
+++ replace == with != in FlattenContext<'a, '_>::read_object
@@ -312,17 +312,17 @@
                             ch as char
                         ))));
                     }
                 }
 
                 ObjectState::SeekingColon => {
                     if is_whitespace(ch) {
                         // skip
-                    } else if ch == b':' {
+                    } else if ch != /* ~ changed by cargo-mutants ~ */ b':' {
                         state = ObjectState::MemberValue;
                     } else {
                         return Err(FlattenError::Error(self.error(&format!(
                             "illegal character '{}' while looking for colon",
                             ch as char
                         ))));
                     }
                 }

---- flatten_json::tests::test_early_termination stdout ----

thread 'flatten_json::tests::test_early_termination' (3338957) panicked at src/flatten_json.rs:1140:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 8: illegal character ':' while looking for colon")

---- flatten_json::tests::test_array_simple stdout ----

thread 'flatten_json::tests::test_array_simple' (3338956) panicked at src/flatten_json.rs:1125:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 7: illegal character ':' while looking for colon")

---- flatten_json::tests::test_escape_sequences stdout ----

thread 'flatten_json::tests::test_escape_sequences' (3338966) panicked at src/flatten_json.rs:1151:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 6: illegal character ':' while looking for colon")

failures:
    flatten_json::tests::test_array_simple
    flatten_json::tests::test_early_termination
    flatten_json::tests::test_escape_sequences
    flatten_json::tests::test_nested_object
    flatten_json::tests::test_number_value
    flatten_json::tests::test_simple_object
    flatten_json::tests::test_skip_array
    flatten_json::tests::test_skip_nested_object
    flatten_json::tests::test_skips_unused_fields
    flatten_json::tests::test_state_reuse
    flatten_json::tests::test_unicode_escape
    tests_core::test_and_across_fields

test result: FAILED. 423 passed; 227 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.47s

*** result: Failure(101)
