*** src/flatten_json.rs:343:25: delete match arm b'"' in FlattenContext<'a, '_>::read_object

*** mutation diff:
--- src/flatten_json.rs
+++ delete match arm b'"' in FlattenContext<'a, '_>::read_object
@@ -335,24 +335,17 @@
                         ch = self.ch();
                     }
 
                     let mut val: Option<FieldValue<'a>> = None;
                     let mut is_number = false;
                     let mut is_leaf = false;
 
                     match ch {
-                        b'"' => {
-                            if self.skipping > 0 || !member_is_used {
-                                self.skip_string_value()?;
-                            } else {
-                                val = Some(self.read_string_value()?);
-                            }
-                            is_leaf = true;
-                        }
+                         /* ~ changed by cargo-mutants ~ */
                         b't' => {
                             self.read_literal(b"true")?;
                             if self.skipping == 0 && member_is_used {
                                 val = Some(FieldValue::Borrowed(b"true"));
                             }
                             is_leaf = true;
                         }
                         b'f' => {

---- flatten_json::tests::test_skip_nested_object stdout ----

thread 'flatten_json::tests::test_skip_nested_object' (3341967) panicked at src/flatten_json.rs:1177:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 42: illegal character '\"' after field name")

---- flatten_json::tests::test_escape_sequences stdout ----

thread 'flatten_json::tests::test_escape_sequences' (3341962) panicked at src/flatten_json.rs:1144:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 8: illegal character '\"' after field name")

---- flatten_json::tests::test_simple_object stdout ----

thread 'flatten_json::tests::test_simple_object' (3341965) panicked at src/flatten_json.rs:1070:50:
called `Result::unwrap()` on an `Err` value: InvalidJson("at line 1 col 11: illegal character '\"' after field name")

failures:
    flatten_json::tests::test_escape_sequences
    flatten_json::tests::test_nested_object
    flatten_json::tests::test_simple_object
    flatten_json::tests::test_skip_array
    flatten_json::tests::test_skip_nested_object
    flatten_json::tests::test_state_reuse
    flatten_json::tests::test_unicode_escape
    tests_core::test_and_across_fields
    tests_core::test_arena_stats_workloads
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_array_cross_element_matching
    tests_core::test_auto_rebuild_disabled

test result: FAILED. 451 passed; 199 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.58s

*** result: Failure(101)
