*** src/flatten_json.rs:351:25: delete match arm b't' in FlattenContext<'a, '_>::read_object

*** mutation diff:
--- src/flatten_json.rs
+++ delete match arm b't' in FlattenContext<'a, '_>::read_object
@@ -343,23 +343,17 @@
                         b'"' => {
                             if self.skipping > 0 || !member_is_used {
                                 self.skip_string_value()?;
                             } else {
                                 val = Some(self.read_string_value()?);
                             }
                             is_leaf = true;
                         }
-                        b't' => {
-                            self.read_literal(b"true")?;
-                            if self.skipping == 0 && member_is_used {
-                                val = Some(FieldValue::Borrowed(b"true"));
-                            }
-                            is_leaf = true;
-                        }
+                         /* ~ changed by cargo-mutants ~ */
                         b'f' => {
                             self.read_literal(b"false")?;
                             if self.skipping == 0 && member_is_used {
                                 val = Some(FieldValue::Borrowed(b"false"));
                             }
                             is_leaf = true;
                         }
                         b'n' => {

*** result: Success
