*** src/flatten_json.rs:57:9: replace Field<'_>::path_str -> &str with "xyzzy"

*** mutation diff:
--- src/flatten_json.rs
+++ replace Field<'_>::path_str -> &str with "xyzzy"
@@ -49,17 +49,17 @@
     /// Returns the path as a string slice.
     ///
     /// # Safety
     /// This uses unsafe conversion because JSON field names are guaranteed
     /// to be valid UTF-8 by the JSON specification.
     #[inline]
     pub fn path_str(&self) -> &str {
         // SAFETY: JSON field names are valid UTF-8 per JSON spec (RFC 8259).
-        unsafe { std::str::from_utf8_unchecked(&self.path) }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the value as raw bytes, preserving surrounding quotes for strings.
     ///
     /// String values retain their quotes (e.g., `"hello"`) so that the automaton
     /// can distinguish strings from numbers with identical digit content.
     /// This mirrors Go's design where quotes act as an implicit type tag.
     #[inline]

---- automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field' (3201368) panicked at src/automaton/mutable_matcher.rs:2290:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_exists_true_no_self_match_direct stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_exists_true_no_self_match_direct' (3201370) panicked at src/automaton/mutable_matcher.rs:2586:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict' (3201366) panicked at src/automaton/mutable_matcher.rs:2348:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_exists_true_no_self_match_direct
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_direct
    automaton::thread_safe::tests::test_tsm_exists_true_no_self_match_direct
    automaton::thread_safe::tests::test_tsm_multi_field_direct
    automaton::thread_safe::tests::test_tsm_no_self_match_direct
    tests_core::test_and_across_fields
    tests_core::test_arena_stats_workloads
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_array_element_matching

test result: FAILED. 440 passed; 210 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.01s

*** result: Failure(101)
