*** src/flatten_json.rs:67:9: replace Field<'_>::value_bytes -> &[u8] with Vec::leak(Vec::new())

*** mutation diff:
--- src/flatten_json.rs
+++ replace Field<'_>::value_bytes -> &[u8] with Vec::leak(Vec::new())
@@ -59,17 +59,17 @@
 
     /// Returns the value as raw bytes, preserving surrounding quotes for strings.
     ///
     /// String values retain their quotes (e.g., `"hello"`) so that the automaton
     /// can distinguish strings from numbers with identical digit content.
     /// This mirrors Go's design where quotes act as an implicit type tag.
     #[inline]
     pub fn value_bytes(&self) -> &[u8] {
-        self.val.as_bytes()
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the array trail as a slice.
     #[inline]
     pub fn array_trail_slice(&self) -> &[ArrayPos] {
         &self.array_trail
     }
 }

---- automaton::mutable_matcher::tests::test_core_matcher_no_self_match_direct stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_no_self_match_direct' (3205272) panicked at src/automaton/mutable_matcher.rs:2468:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_exists_true_no_self_match_direct stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_exists_true_no_self_match_direct' (3205268) panicked at src/automaton/mutable_matcher.rs:2586:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict' (3205264) panicked at src/automaton/mutable_matcher.rs:2348:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict
    automaton::mutable_matcher::tests::test_core_matcher_direct_multi_field
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_exists_true_no_self_match_direct
    automaton::mutable_matcher::tests::test_core_matcher_no_self_match_direct
    automaton::thread_safe::tests::test_tsm_exists_true_no_self_match_direct
    automaton::thread_safe::tests::test_tsm_multi_field_direct
    automaton::thread_safe::tests::test_tsm_no_self_match_direct
    tests_core::test_and_across_fields
    tests_core::test_arena_stats_workloads
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_array_element_matching

test result: FAILED. 441 passed; 209 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.10s

*** result: Failure(101)
