*** src/flatten_json.rs:73:9: replace Field<'_>::array_trail_slice -> &[ArrayPos] with Vec::leak(Vec::new())

*** mutation diff:
--- src/flatten_json.rs
+++ replace Field<'_>::array_trail_slice -> &[ArrayPos] with Vec::leak(Vec::new())
@@ -65,17 +65,17 @@
     #[inline]
     pub fn value_bytes(&self) -> &[u8] {
         self.val.as_bytes()
     }
 
     /// Returns the array trail as a slice.
     #[inline]
     pub fn array_trail_slice(&self) -> &[ArrayPos] {
-        &self.array_trail
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Field value - either a slice of the original event or an owned string
 /// for values containing escape sequences.
 #[derive(Clone, Debug)]
 pub enum FieldValue<'a> {
     /// Borrowed slice from original event (zero-copy)

---- automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict' (3216756) panicked at src/automaton/mutable_matcher.rs:2329:9:
assertion failed: cm.matches_for_fields_direct(&conflicting, &mut bufs).is_empty()

---- tests_core::test_array_cross_element_matching stdout ----

thread 'tests_core::test_array_cross_element_matching' (3217000) panicked at src/tests_core.rs:193:5:
Should not match across different array elements (event: {"members": [
        {"given": "Joe", "surname": "Strummer"},
        {"given": "Mick", "surname": "Jones"}
    ]})

---- tests_core::test_array_cross_element_comprehensive stdout ----

thread 'tests_core::test_array_cross_element_comprehensive' (3216999) panicked at src/tests_core.rs:230:5:
assertion `left == right` failed: Expected 1 matches for {
        "bands": [
            {
                "name": "The Clash",
                "members": [
                    {"given": "Joe", "surname": "Strummer", "role": ["guitar", "vocals"]},
                    {"given": "Mick", "surname": "Jones", "role": ["guitar", "vocals"]},
                    {"given": "Paul", "surname": "Simonon", "role": ["bass"]},
                    {"given": "Topper", "surname": "Headon", "role": ["drums"]}
                ]
            },

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_array_trail_conflict
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_array_cross_element_matching

test result: FAILED. 647 passed; 3 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.10s

*** result: Failure(101)
