*** src/flatten_json.rs:95:9: replace MemberName<'_>::as_bytes -> &[u8] with Vec::leak(vec![0])

*** mutation diff:
--- src/flatten_json.rs
+++ replace MemberName<'_>::as_bytes -> &[u8] with Vec::leak(vec![0])
@@ -87,20 +87,17 @@
 /// Member name - either borrowed or owned if it contains escapes.
 enum MemberName<'a> {
     Borrowed(&'a [u8]),
     Owned(Vec<u8>),
 }
 
 impl MemberName<'_> {
     fn as_bytes(&self) -> &[u8] {
-        match self {
-            MemberName::Borrowed(b) => b,
-            MemberName::Owned(v) => v.as_slice(),
-        }
+        Vec::leak(vec![0]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FieldValue<'_> {
     pub fn as_bytes(&self) -> &[u8] {
         match self {
             FieldValue::Borrowed(s) => s,
             FieldValue::Owned(v) => v,

---- flatten_json::tests::test_early_termination stdout ----

thread 'flatten_json::tests::test_early_termination' (3224599) panicked at src/flatten_json.rs:1139:9:
assertion `left == right` failed
  left: 0
 right: 1

---- flatten_json::tests::test_error_invalid_json_structure stdout ----

thread 'flatten_json::tests::test_error_invalid_json_structure' (3224601) panicked at src/flatten_json.rs:1309:13:
Should reject invalid structure: {"a" : [ foo ]}

---- flatten_json::tests::test_error_invalid_nested_object stdout ----

thread 'flatten_json::tests::test_error_invalid_nested_object' (3224602) panicked at src/flatten_json.rs:1322:9:
Should reject invalid nested object: {"a": { x }}

failures:
    flatten_json::tests::test_array_simple
    flatten_json::tests::test_early_termination
    flatten_json::tests::test_error_invalid_json_structure
    flatten_json::tests::test_error_invalid_nested_object
    flatten_json::tests::test_escape_sequences
    flatten_json::tests::test_nested_object
    flatten_json::tests::test_number_value
    flatten_json::tests::test_simple_object
    flatten_json::tests::test_skip_array
    flatten_json::tests::test_skip_nested_object
    flatten_json::tests::test_skips_unused_fields
    flatten_json::tests::test_state_reuse

test result: FAILED. 434 passed; 216 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.30s

*** result: Failure(101)
