*** src/json.rs:109:9: replace CidrPattern::parse_ipv4 -> Option<[u8; 4]> with None

*** mutation diff:
--- src/json.rs
+++ replace CidrPattern::parse_ipv4 -> Option<[u8; 4]> with None
@@ -101,25 +101,17 @@
             });
         }
 
         None
     }
 
     /// Parse an IPv4 address string
     fn parse_ipv4(s: &str) -> Option<[u8; 4]> {
-        let parts: Vec<&str> = s.split('.').collect();
-        if parts.len() != 4 {
-            return None;
-        }
-        let mut addr = [0u8; 4];
-        for (i, part) in parts.iter().enumerate() {
-            addr[i] = part.parse().ok()?;
-        }
-        Some(addr)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Parse an IPv6 address string (supports :: shorthand)
     fn parse_ipv6(s: &str) -> Option<[u8; 16]> {
         let mut addr = [0u8; 16];
 
         // Handle :: shorthand
         if s.contains("::") {

---- tests_core::test_default_limits_allow_normal_patterns stdout ----

thread 'tests_core::test_default_limits_allow_normal_patterns' (2822161) panicked at src/tests_core.rs:2032:5:
assertion failed: q.add_pattern("cidr", r#"{"x": [{"cidr": "10.0.0.0/8"}]}"#).is_ok()

---- tests_operators::test_cidr_ipv4_prefix_mask_boundary stdout ----

thread 'tests_operators::test_cidr_ipv4_prefix_mask_boundary' (2822244) panicked at src/tests_operators.rs:672:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 10.0.0.1/32")

---- tests_operators::test_cidr_ipv4_basic stdout ----

thread 'tests_operators::test_cidr_ipv4_basic' (2822243) panicked at src/tests_operators.rs:626:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 10.0.0.0/24")

failures:
    tests_core::test_default_limits_allow_normal_patterns
    tests_operators::test_cidr_ipv4_basic
    tests_operators::test_cidr_ipv4_prefix_mask_boundary
    tests_operators::test_cidr_ipv4_prefix_various_lengths
    tests_operators::test_cidr_ipv4_various_prefixes
    tests_operators::test_cidr_miri_lightweight
    tests_operators::test_cidr_non_ip_values
    tests_operators::test_cidr_with_other_matchers

test result: FAILED. 639 passed; 8 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.54s

*** result: Failure(101)
