*** src/json.rs:109:9: replace CidrPattern::parse_ipv4 -> Option<[u8; 4]> with Some([1; 4])

*** mutation diff:
--- src/json.rs
+++ replace CidrPattern::parse_ipv4 -> Option<[u8; 4]> with Some([1; 4])
@@ -101,25 +101,17 @@
             });
         }
 
         None
     }
 
     /// Parse an IPv4 address string
     fn parse_ipv4(s: &str) -> Option<[u8; 4]> {
-        let parts: Vec<&str> = s.split('.').collect();
-        if parts.len() != 4 {
-            return None;
-        }
-        let mut addr = [0u8; 4];
-        for (i, part) in parts.iter().enumerate() {
-            addr[i] = part.parse().ok()?;
-        }
-        Some(addr)
+        Some([1; 4]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Parse an IPv6 address string (supports :: shorthand)
     fn parse_ipv6(s: &str) -> Option<[u8; 16]> {
         let mut addr = [0u8; 16];
 
         // Handle :: shorthand
         if s.contains("::") {

---- tests_operators::test_cidr_ipv4_prefix_mask_boundary stdout ----

thread 'tests_operators::test_cidr_ipv4_prefix_mask_boundary' (3087642) panicked at src/tests_operators.rs:675:5:
assertion `left == right` failed: 10.0.0.1 should match /32 with 10.0.0.1 (event: {"ip": "10.0.0.1"})
  left: []
 right: ["p32"]

---- tests_operators::test_cidr_invalid_patterns stdout ----

thread 'tests_operators::test_cidr_invalid_patterns' (3087640) panicked at src/tests_operators.rs:661:5:
Invalid IP should be rejected

---- tests_operators::test_cidr_ipv4_basic stdout ----

thread 'tests_operators::test_cidr_ipv4_basic' (3087641) panicked at src/tests_operators.rs:627:5:
assertion `left == right` failed: 10.0.0.1 in /24 (event: {"sourceIP": "10.0.0.1"})
  left: []
 right: ["p1"]

failures:
    tests_operators::test_cidr_invalid_patterns
    tests_operators::test_cidr_ipv4_basic
    tests_operators::test_cidr_ipv4_prefix_mask_boundary
    tests_operators::test_cidr_ipv4_prefix_various_lengths
    tests_operators::test_cidr_ipv4_various_prefixes
    tests_operators::test_cidr_ipv6_basic
    tests_operators::test_cidr_ipv6_double_colon_variations
    tests_operators::test_cidr_ipv6_group_limit
    tests_operators::test_cidr_ipv6_shorthand
    tests_operators::test_cidr_miri_lightweight
    tests_operators::test_cidr_with_other_matchers

test result: FAILED. 639 passed; 11 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.12s

*** result: Failure(101)
