*** src/json.rs:110:24: replace != with == in CidrPattern::parse_ipv4

*** mutation diff:
--- src/json.rs
+++ replace != with == in CidrPattern::parse_ipv4
@@ -102,17 +102,17 @@
         }
 
         None
     }
 
     /// Parse an IPv4 address string
     fn parse_ipv4(s: &str) -> Option<[u8; 4]> {
         let parts: Vec<&str> = s.split('.').collect();
-        if parts.len() != 4 {
+        if parts.len() == /* ~ changed by cargo-mutants ~ */ 4 {
             return None;
         }
         let mut addr = [0u8; 4];
         for (i, part) in parts.iter().enumerate() {
             addr[i] = part.parse().ok()?;
         }
         Some(addr)
     }

---- tests_core::test_default_limits_allow_normal_patterns stdout ----

thread 'tests_core::test_default_limits_allow_normal_patterns' (3091426) panicked at src/tests_core.rs:2032:5:
assertion failed: q.add_pattern("cidr", r#"{"x": [{"cidr": "10.0.0.0/8"}]}"#).is_ok()

---- tests_operators::test_cidr_ipv4_prefix_mask_boundary stdout ----

thread 'tests_operators::test_cidr_ipv4_prefix_mask_boundary' (3091509) panicked at src/tests_operators.rs:672:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 10.0.0.1/32")

---- tests_operators::test_cidr_ipv4_prefix_various_lengths stdout ----

thread 'tests_operators::test_cidr_ipv4_prefix_various_lengths' (3091510) panicked at src/tests_operators.rs:706:17:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 172.16.0.0/16")

failures:
    tests_core::test_default_limits_allow_normal_patterns
    tests_operators::test_cidr_ipv4_basic
    tests_operators::test_cidr_ipv4_prefix_mask_boundary
    tests_operators::test_cidr_ipv4_prefix_various_lengths
    tests_operators::test_cidr_ipv4_various_prefixes
    tests_operators::test_cidr_miri_lightweight
    tests_operators::test_cidr_non_ip_values
    tests_operators::test_cidr_with_other_matchers

test result: FAILED. 642 passed; 8 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.14s

*** result: Failure(101)
