*** src/json.rs:122:9: replace CidrPattern::parse_ipv6 -> Option<[u8; 16]> with None

*** mutation diff:
--- src/json.rs
+++ replace CidrPattern::parse_ipv6 -> Option<[u8; 16]> with None
@@ -114,68 +114,17 @@
         for (i, part) in parts.iter().enumerate() {
             addr[i] = part.parse().ok()?;
         }
         Some(addr)
     }
 
     /// Parse an IPv6 address string (supports :: shorthand)
     fn parse_ipv6(s: &str) -> Option<[u8; 16]> {
-        let mut addr = [0u8; 16];
-
-        // Handle :: shorthand
-        if s.contains("::") {
-            let parts: Vec<&str> = s.split("::").collect();
-            if parts.len() > 2 {
-                return None; // Invalid: more than one ::
-            }
-
-            let left: Vec<&str> = if parts[0].is_empty() {
-                vec![]
-            } else {
-                parts[0].split(':').collect()
-            };
-            let right: Vec<&str> = if parts.len() > 1 && !parts[1].is_empty() {
-                parts[1].split(':').collect()
-            } else {
-                vec![]
-            };
-
-            if left.len() + right.len() > 8 {
-                return None;
-            }
-
-            // Fill left part
-            for (i, part) in left.iter().enumerate() {
-                let val = u16::from_str_radix(part, 16).ok()?;
-                addr[i * 2] = (val >> 8) as u8;
-                addr[i * 2 + 1] = val as u8;
-            }
-
-            // Fill right part (from the end)
-            let right_start = 8 - right.len();
-            for (i, part) in right.iter().enumerate() {
-                let val = u16::from_str_radix(part, 16).ok()?;
-                addr[(right_start + i) * 2] = (val >> 8) as u8;
-                addr[(right_start + i) * 2 + 1] = val as u8;
-            }
-        } else {
-            // Full address
-            let parts: Vec<&str> = s.split(':').collect();
-            if parts.len() != 8 {
-                return None;
-            }
-            for (i, part) in parts.iter().enumerate() {
-                let val = u16::from_str_radix(part, 16).ok()?;
-                addr[i * 2] = (val >> 8) as u8;
-                addr[i * 2 + 1] = val as u8;
-            }
-        }
-
-        Some(addr)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Apply a prefix mask to an IPv6 address
     fn apply_ipv6_mask(addr: &[u8; 16], prefix_len: u8) -> [u8; 16] {
         let mut result = *addr;
         let full_bytes = (prefix_len / 8) as usize;
         let remaining_bits = prefix_len % 8;

---- tests_operators::test_cidr_ipv6_basic stdout ----

thread 'tests_operators::test_cidr_ipv6_basic' (3095383) panicked at src/tests_operators.rs:2951:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8::/32")

---- tests_operators::test_cidr_ipv6_double_colon_variations stdout ----

thread 'tests_operators::test_cidr_ipv6_double_colon_variations' (3095384) panicked at src/tests_operators.rs:742:17:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8::1/128")

---- tests_operators::test_cidr_ipv6_group_limit stdout ----

thread 'tests_operators::test_cidr_ipv6_group_limit' (3095385) panicked at src/tests_operators.rs:764:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8:0:0:0:0:0:1/128")

failures:
    tests_operators::test_cidr_ipv6_basic
    tests_operators::test_cidr_ipv6_double_colon_variations
    tests_operators::test_cidr_ipv6_group_limit
    tests_operators::test_cidr_ipv6_shorthand

test result: FAILED. 646 passed; 4 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.05s

*** result: Failure(101)
