*** src/json.rs:127:28: replace > with == in CidrPattern::parse_ipv6

*** mutation diff:
--- src/json.rs
+++ replace > with == in CidrPattern::parse_ipv6
@@ -119,17 +119,17 @@
 
     /// Parse an IPv6 address string (supports :: shorthand)
     fn parse_ipv6(s: &str) -> Option<[u8; 16]> {
         let mut addr = [0u8; 16];
 
         // Handle :: shorthand
         if s.contains("::") {
             let parts: Vec<&str> = s.split("::").collect();
-            if parts.len() > 2 {
+            if parts.len() == /* ~ changed by cargo-mutants ~ */ 2 {
                 return None; // Invalid: more than one ::
             }
 
             let left: Vec<&str> = if parts[0].is_empty() {
                 vec![]
             } else {
                 parts[0].split(':').collect()
             };

---- tests_operators::test_cidr_ipv6_basic stdout ----

thread 'tests_operators::test_cidr_ipv6_basic' (3107035) panicked at src/tests_operators.rs:2951:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8::/32")

---- tests_operators::test_cidr_ipv6_double_colon_variations stdout ----

thread 'tests_operators::test_cidr_ipv6_double_colon_variations' (3107036) panicked at src/tests_operators.rs:742:17:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8::1/128")

---- tests_operators::test_cidr_ipv6_shorthand stdout ----

thread 'tests_operators::test_cidr_ipv6_shorthand' (3107039) panicked at src/tests_operators.rs:2974:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: ::1/128")

failures:
    tests_operators::test_cidr_ipv6_basic
    tests_operators::test_cidr_ipv6_double_colon_variations
    tests_operators::test_cidr_ipv6_shorthand

test result: FAILED. 647 passed; 3 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.09s

*** result: Failure(101)
