*** src/json.rs:136:51: replace > with == in CidrPattern::parse_ipv6

*** mutation diff:
--- src/json.rs
+++ replace > with == in CidrPattern::parse_ipv6
@@ -128,17 +128,17 @@
                 return None; // Invalid: more than one ::
             }
 
             let left: Vec<&str> = if parts[0].is_empty() {
                 vec![]
             } else {
                 parts[0].split(':').collect()
             };
-            let right: Vec<&str> = if parts.len() > 1 && !parts[1].is_empty() {
+            let right: Vec<&str> = if parts.len() == /* ~ changed by cargo-mutants ~ */ 1 && !parts[1].is_empty() {
                 parts[1].split(':').collect()
             } else {
                 vec![]
             };
 
             if left.len() + right.len() > 8 {
                 return None;
             }

---- tests_operators::test_cidr_ipv6_double_colon_variations stdout ----

thread 'tests_operators::test_cidr_ipv6_double_colon_variations' (3123304) panicked at src/tests_operators.rs:746:9:
assertion `left == right` failed: 2001:db8:0:0:0:0:0:1 should match 2001:db8::1/128 (event: {"ip": "2001:db8:0:0:0:0:0:1"})
  left: []
 right: ["p1"]

---- tests_operators::test_cidr_ipv6_invalid_formats stdout ----

thread 'tests_operators::test_cidr_ipv6_invalid_formats' (3123306) panicked at src/tests_operators.rs:789:5:
Multiple :: should be rejected

---- tests_operators::test_cidr_ipv6_shorthand stdout ----

thread 'tests_operators::test_cidr_ipv6_shorthand' (3123307) panicked at src/tests_operators.rs:2975:5:
assertion `left == right` failed: Loopback should match (event: {"ip": "0:0:0:0:0:0:0:1"})
  left: []
 right: ["loopback"]

failures:
    tests_operators::test_cidr_ipv6_double_colon_variations
    tests_operators::test_cidr_ipv6_invalid_formats
    tests_operators::test_cidr_ipv6_shorthand

test result: FAILED. 647 passed; 3 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.12s

*** result: Failure(101)
