*** src/json.rs:136:51: replace > with >= in CidrPattern::parse_ipv6

*** mutation diff:
--- src/json.rs
+++ replace > with >= in CidrPattern::parse_ipv6
@@ -128,17 +128,17 @@
                 return None; // Invalid: more than one ::
             }
 
             let left: Vec<&str> = if parts[0].is_empty() {
                 vec![]
             } else {
                 parts[0].split(':').collect()
             };
-            let right: Vec<&str> = if parts.len() > 1 && !parts[1].is_empty() {
+            let right: Vec<&str> = if parts.len() >= /* ~ changed by cargo-mutants ~ */ 1 && !parts[1].is_empty() {
                 parts[1].split(':').collect()
             } else {
                 vec![]
             };
 
             if left.len() + right.len() > 8 {
                 return None;
             }

*** result: Success
