*** src/json.rs:136:55: replace && with || in CidrPattern::parse_ipv6

*** mutation diff:
--- src/json.rs
+++ replace && with || in CidrPattern::parse_ipv6
@@ -128,17 +128,17 @@
                 return None; // Invalid: more than one ::
             }
 
             let left: Vec<&str> = if parts[0].is_empty() {
                 vec![]
             } else {
                 parts[0].split(':').collect()
             };
-            let right: Vec<&str> = if parts.len() > 1 && !parts[1].is_empty() {
+            let right: Vec<&str> = if parts.len() > 1 || /* ~ changed by cargo-mutants ~ */ !parts[1].is_empty() {
                 parts[1].split(':').collect()
             } else {
                 vec![]
             };
 
             if left.len() + right.len() > 8 {
                 return None;
             }

---- tests_operators::test_cidr_ipv6_basic stdout ----

thread 'tests_operators::test_cidr_ipv6_basic' (3119415) panicked at src/tests_operators.rs:2951:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8::/32")

---- tests_operators::test_cidr_ipv6_double_colon_variations stdout ----

thread 'tests_operators::test_cidr_ipv6_double_colon_variations' (3119416) panicked at src/tests_operators.rs:742:17:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8::/32")

failures:
    tests_operators::test_cidr_ipv6_basic
    tests_operators::test_cidr_ipv6_double_colon_variations

test result: FAILED. 648 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.14s

*** result: Failure(101)
