*** src/json.rs:136:58: delete ! in CidrPattern::parse_ipv6

*** mutation diff:
--- src/json.rs
+++ delete ! in CidrPattern::parse_ipv6
@@ -128,17 +128,17 @@
                 return None; // Invalid: more than one ::
             }
 
             let left: Vec<&str> = if parts[0].is_empty() {
                 vec![]
             } else {
                 parts[0].split(':').collect()
             };
-            let right: Vec<&str> = if parts.len() > 1 && !parts[1].is_empty() {
+            let right: Vec<&str> = if parts.len() > 1 &&  /* ~ changed by cargo-mutants ~ */parts[1].is_empty() {
                 parts[1].split(':').collect()
             } else {
                 vec![]
             };
 
             if left.len() + right.len() > 8 {
                 return None;
             }

---- tests_operators::test_cidr_ipv6_basic stdout ----

thread 'tests_operators::test_cidr_ipv6_basic' (3135719) panicked at src/tests_operators.rs:2951:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8::/32")

---- tests_operators::test_cidr_ipv6_double_colon_variations stdout ----

thread 'tests_operators::test_cidr_ipv6_double_colon_variations' (3135720) panicked at src/tests_operators.rs:746:9:
assertion `left == right` failed: 2001:db8:0:0:0:0:0:1 should match 2001:db8::1/128 (event: {"ip": "2001:db8:0:0:0:0:0:1"})
  left: []
 right: ["p1"]

---- tests_operators::test_cidr_ipv6_invalid_formats stdout ----

thread 'tests_operators::test_cidr_ipv6_invalid_formats' (3135722) panicked at src/tests_operators.rs:789:5:
Multiple :: should be rejected

failures:
    tests_operators::test_cidr_ipv6_basic
    tests_operators::test_cidr_ipv6_double_colon_variations
    tests_operators::test_cidr_ipv6_invalid_formats
    tests_operators::test_cidr_ipv6_shorthand

test result: FAILED. 646 passed; 4 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.17s

*** result: Failure(101)
