*** src/json.rs:142:27: replace + with - in CidrPattern::parse_ipv6

*** mutation diff:
--- src/json.rs
+++ replace + with - in CidrPattern::parse_ipv6
@@ -134,17 +134,17 @@
                 parts[0].split(':').collect()
             };
             let right: Vec<&str> = if parts.len() > 1 && !parts[1].is_empty() {
                 parts[1].split(':').collect()
             } else {
                 vec![]
             };
 
-            if left.len() + right.len() > 8 {
+            if left.len() - /* ~ changed by cargo-mutants ~ */ right.len() > 8 {
                 return None;
             }
 
             // Fill left part
             for (i, part) in left.iter().enumerate() {
                 let val = u16::from_str_radix(part, 16).ok()?;
                 addr[i * 2] = (val >> 8) as u8;
                 addr[i * 2 + 1] = val as u8;

---- tests_operators::test_cidr_ipv6_double_colon_variations stdout ----

thread 'tests_operators::test_cidr_ipv6_double_colon_variations' (3153412) panicked at src/json.rs:142:16:
attempt to subtract with overflow

---- tests_operators::test_cidr_ipv6_shorthand stdout ----

thread 'tests_operators::test_cidr_ipv6_shorthand' (3153415) panicked at src/json.rs:142:16:
attempt to subtract with overflow

failures:
    tests_operators::test_cidr_ipv6_double_colon_variations
    tests_operators::test_cidr_ipv6_shorthand

test result: FAILED. 648 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.19s

*** result: Failure(101)
