*** src/json.rs:142:41: replace > with == in CidrPattern::parse_ipv6

*** mutation diff:
--- src/json.rs
+++ replace > with == in CidrPattern::parse_ipv6
@@ -134,17 +134,17 @@
                 parts[0].split(':').collect()
             };
             let right: Vec<&str> = if parts.len() > 1 && !parts[1].is_empty() {
                 parts[1].split(':').collect()
             } else {
                 vec![]
             };
 
-            if left.len() + right.len() > 8 {
+            if left.len() + right.len() == /* ~ changed by cargo-mutants ~ */ 8 {
                 return None;
             }
 
             // Fill left part
             for (i, part) in left.iter().enumerate() {
                 let val = u16::from_str_radix(part, 16).ok()?;
                 addr[i * 2] = (val >> 8) as u8;
                 addr[i * 2 + 1] = val as u8;

*** result: Success
