*** src/json.rs:142:41: replace > with < in CidrPattern::parse_ipv6

*** mutation diff:
--- src/json.rs
+++ replace > with < in CidrPattern::parse_ipv6
@@ -134,17 +134,17 @@
                 parts[0].split(':').collect()
             };
             let right: Vec<&str> = if parts.len() > 1 && !parts[1].is_empty() {
                 parts[1].split(':').collect()
             } else {
                 vec![]
             };
 
-            if left.len() + right.len() > 8 {
+            if left.len() + right.len() < /* ~ changed by cargo-mutants ~ */ 8 {
                 return None;
             }
 
             // Fill left part
             for (i, part) in left.iter().enumerate() {
                 let val = u16::from_str_radix(part, 16).ok()?;
                 addr[i * 2] = (val >> 8) as u8;
                 addr[i * 2 + 1] = val as u8;

---- tests_operators::test_cidr_ipv6_basic stdout ----

thread 'tests_operators::test_cidr_ipv6_basic' (3144357) panicked at src/tests_operators.rs:2951:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8::/32")

---- tests_operators::test_cidr_ipv6_double_colon_variations stdout ----

thread 'tests_operators::test_cidr_ipv6_double_colon_variations' (3144358) panicked at src/tests_operators.rs:742:17:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8::1/128")

---- tests_operators::test_cidr_ipv6_shorthand stdout ----

thread 'tests_operators::test_cidr_ipv6_shorthand' (3144361) panicked at src/tests_operators.rs:2974:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: ::1/128")

failures:
    tests_operators::test_cidr_ipv6_basic
    tests_operators::test_cidr_ipv6_double_colon_variations
    tests_operators::test_cidr_ipv6_shorthand

test result: FAILED. 647 passed; 3 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.17s

*** result: Failure(101)
