*** src/json.rs:70:9: replace CidrPattern::parse -> Option<Self> with None

*** mutation diff:
--- src/json.rs
+++ replace CidrPattern::parse -> Option<Self> with None
@@ -62,51 +62,17 @@
 pub enum CidrPattern {
     V4 { network: [u8; 4], prefix_len: u8 },
     V6 { network: [u8; 16], prefix_len: u8 },
 }
 
 impl CidrPattern {
     /// Parse a CIDR notation string (e.g., "10.0.0.0/24" or "2001:db8::/32")
     pub fn parse(s: &str) -> Option<Self> {
-        let (addr_str, prefix_str) = s.split_once('/')?;
-        let prefix_len: u8 = prefix_str.parse().ok()?;
-
-        // Try IPv4 first
-        if let Some(addr) = Self::parse_ipv4(addr_str) {
-            if prefix_len > 32 {
-                return None;
-            }
-            // Apply mask to get network address
-            let mask = if prefix_len == 0 {
-                0u32
-            } else {
-                !0u32 << (32 - prefix_len)
-            };
-            let network_bits = u32::from_be_bytes(addr) & mask;
-            return Some(Self::V4 {
-                network: network_bits.to_be_bytes(),
-                prefix_len,
-            });
-        }
-
-        // Try IPv6
-        if let Some(addr) = Self::parse_ipv6(addr_str) {
-            if prefix_len > 128 {
-                return None;
-            }
-            // Apply mask to get network address
-            let network = Self::apply_ipv6_mask(&addr, prefix_len);
-            return Some(Self::V6 {
-                network,
-                prefix_len,
-            });
-        }
-
-        None
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Parse an IPv4 address string
     fn parse_ipv4(s: &str) -> Option<[u8; 4]> {
         let parts: Vec<&str> = s.split('.').collect();
         if parts.len() != 4 {
             return None;
         }

---- tests_core::test_default_limits_allow_normal_patterns stdout ----

thread 'tests_core::test_default_limits_allow_normal_patterns' (3025405) panicked at src/tests_core.rs:2032:5:
assertion failed: q.add_pattern("cidr", r#"{"x": [{"cidr": "10.0.0.0/8"}]}"#).is_ok()

---- tests_operators::test_cidr_ipv4_basic stdout ----

thread 'tests_operators::test_cidr_ipv4_basic' (3025487) panicked at src/tests_operators.rs:626:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 10.0.0.0/24")

---- tests_operators::test_cidr_ipv4_prefix_mask_boundary stdout ----

thread 'tests_operators::test_cidr_ipv4_prefix_mask_boundary' (3025488) panicked at src/tests_operators.rs:672:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 10.0.0.1/32")

failures:
    tests_core::test_default_limits_allow_normal_patterns
    tests_operators::test_cidr_ipv4_basic
    tests_operators::test_cidr_ipv4_prefix_mask_boundary
    tests_operators::test_cidr_ipv4_prefix_various_lengths
    tests_operators::test_cidr_ipv4_various_prefixes
    tests_operators::test_cidr_ipv6_basic
    tests_operators::test_cidr_ipv6_double_colon_variations
    tests_operators::test_cidr_ipv6_group_limit
    tests_operators::test_cidr_ipv6_shorthand
    tests_operators::test_cidr_miri_lightweight
    tests_operators::test_cidr_non_ip_values
    tests_operators::test_cidr_with_other_matchers

test result: FAILED. 638 passed; 12 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.19s

*** result: Failure(101)
