*** src/json.rs:75:27: replace > with < in CidrPattern::parse

*** mutation diff:
--- src/json.rs
+++ replace > with < in CidrPattern::parse
@@ -67,17 +67,17 @@
 impl CidrPattern {
     /// Parse a CIDR notation string (e.g., "10.0.0.0/24" or "2001:db8::/32")
     pub fn parse(s: &str) -> Option<Self> {
         let (addr_str, prefix_str) = s.split_once('/')?;
         let prefix_len: u8 = prefix_str.parse().ok()?;
 
         // Try IPv4 first
         if let Some(addr) = Self::parse_ipv4(addr_str) {
-            if prefix_len > 32 {
+            if prefix_len < /* ~ changed by cargo-mutants ~ */ 32 {
                 return None;
             }
             // Apply mask to get network address
             let mask = if prefix_len == 0 {
                 0u32
             } else {
                 !0u32 << (32 - prefix_len)
             };

---- tests_core::test_default_limits_allow_normal_patterns stdout ----

thread 'tests_core::test_default_limits_allow_normal_patterns' (2775654) panicked at src/tests_core.rs:2032:5:
assertion failed: q.add_pattern("cidr", r#"{"x": [{"cidr": "10.0.0.0/8"}]}"#).is_ok()

---- tests_operators::test_cidr_invalid_patterns stdout ----

thread 'tests_operators::test_cidr_invalid_patterns' (2775735) panicked at src/json.rs:82:26:
attempt to subtract with overflow

---- tests_operators::test_cidr_ipv4_basic stdout ----

thread 'tests_operators::test_cidr_ipv4_basic' (2775736) panicked at src/tests_operators.rs:626:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 10.0.0.0/24")

failures:
    tests_core::test_default_limits_allow_normal_patterns
    tests_operators::test_cidr_invalid_patterns
    tests_operators::test_cidr_ipv4_basic
    tests_operators::test_cidr_ipv4_prefix_various_lengths
    tests_operators::test_cidr_ipv4_various_prefixes
    tests_operators::test_cidr_miri_lightweight
    tests_operators::test_cidr_non_ip_values
    tests_operators::test_cidr_with_other_matchers

test result: FAILED. 639 passed; 8 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.21s

*** result: Failure(101)
