*** src/json.rs:75:27: replace > with >= in CidrPattern::parse

*** mutation diff:
--- src/json.rs
+++ replace > with >= in CidrPattern::parse
@@ -67,17 +67,17 @@
 impl CidrPattern {
     /// Parse a CIDR notation string (e.g., "10.0.0.0/24" or "2001:db8::/32")
     pub fn parse(s: &str) -> Option<Self> {
         let (addr_str, prefix_str) = s.split_once('/')?;
         let prefix_len: u8 = prefix_str.parse().ok()?;
 
         // Try IPv4 first
         if let Some(addr) = Self::parse_ipv4(addr_str) {
-            if prefix_len > 32 {
+            if prefix_len >= /* ~ changed by cargo-mutants ~ */ 32 {
                 return None;
             }
             // Apply mask to get network address
             let mask = if prefix_len == 0 {
                 0u32
             } else {
                 !0u32 << (32 - prefix_len)
             };

---- tests_operators::test_cidr_ipv4_prefix_mask_boundary stdout ----

thread 'tests_operators::test_cidr_ipv4_prefix_mask_boundary' (3037052) panicked at src/tests_operators.rs:672:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 10.0.0.1/32")

---- tests_operators::test_cidr_ipv4_various_prefixes stdout ----

thread 'tests_operators::test_cidr_ipv4_various_prefixes' (3037054) panicked at src/tests_operators.rs:2934:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 8.8.8.8/32")

failures:
    tests_operators::test_cidr_ipv4_prefix_mask_boundary
    tests_operators::test_cidr_ipv4_various_prefixes

test result: FAILED. 648 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.15s

*** result: Failure(101)
