*** src/json.rs:82:17: delete ! in CidrPattern::parse

*** mutation diff:
--- src/json.rs
+++ delete ! in CidrPattern::parse
@@ -74,17 +74,17 @@
         if let Some(addr) = Self::parse_ipv4(addr_str) {
             if prefix_len > 32 {
                 return None;
             }
             // Apply mask to get network address
             let mask = if prefix_len == 0 {
                 0u32
             } else {
-                !0u32 << (32 - prefix_len)
+                 /* ~ changed by cargo-mutants ~ */0u32 << (32 - prefix_len)
             };
             let network_bits = u32::from_be_bytes(addr) & mask;
             return Some(Self::V4 {
                 network: network_bits.to_be_bytes(),
                 prefix_len,
             });
         }

---- tests_operators::test_cidr_ipv4_prefix_mask_boundary stdout ----

thread 'tests_operators::test_cidr_ipv4_prefix_mask_boundary' (3048820) panicked at src/tests_operators.rs:675:5:
assertion `left == right` failed: 10.0.0.1 should match /32 with 10.0.0.1 (event: {"ip": "10.0.0.1"})
  left: []
 right: ["p32"]

---- tests_operators::test_cidr_ipv4_basic stdout ----

thread 'tests_operators::test_cidr_ipv4_basic' (3048819) panicked at src/tests_operators.rs:627:5:
assertion `left == right` failed: 10.0.0.1 in /24 (event: {"sourceIP": "10.0.0.1"})
  left: []
 right: ["p1"]

---- tests_operators::test_cidr_ipv4_prefix_various_lengths stdout ----

thread 'tests_operators::test_cidr_ipv4_prefix_various_lengths' (3048821) panicked at src/tests_operators.rs:710:9:
assertion `left == right` failed: /16: 172.16.255.255 should match 172.16.0.0/16 (event: {"ip": "172.16.255.255"})
  left: []
 right: ["p1"]

failures:
    tests_operators::test_cidr_ipv4_basic
    tests_operators::test_cidr_ipv4_prefix_mask_boundary
    tests_operators::test_cidr_ipv4_prefix_various_lengths
    tests_operators::test_cidr_ipv4_various_prefixes
    tests_operators::test_cidr_miri_lightweight
    tests_operators::test_cidr_with_other_matchers

test result: FAILED. 644 passed; 6 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.22s

*** result: Failure(101)
