*** src/json.rs:82:30: replace - with + in CidrPattern::parse

*** mutation diff:
--- src/json.rs
+++ replace - with + in CidrPattern::parse
@@ -74,17 +74,17 @@
         if let Some(addr) = Self::parse_ipv4(addr_str) {
             if prefix_len > 32 {
                 return None;
             }
             // Apply mask to get network address
             let mask = if prefix_len == 0 {
                 0u32
             } else {
-                !0u32 << (32 - prefix_len)
+                !0u32 << (32 + /* ~ changed by cargo-mutants ~ */ prefix_len)
             };
             let network_bits = u32::from_be_bytes(addr) & mask;
             return Some(Self::V4 {
                 network: network_bits.to_be_bytes(),
                 prefix_len,
             });
         }

---- tests_core::test_default_limits_allow_normal_patterns stdout ----

thread 'tests_core::test_default_limits_allow_normal_patterns' (3052611) panicked at src/json.rs:82:17:
attempt to shift left with overflow

---- tests_operators::test_cidr_ipv4_prefix_mask_boundary stdout ----

thread 'tests_operators::test_cidr_ipv4_prefix_mask_boundary' (3052694) panicked at src/json.rs:82:17:
attempt to shift left with overflow

---- tests_operators::test_cidr_ipv4_basic stdout ----

thread 'tests_operators::test_cidr_ipv4_basic' (3052693) panicked at src/json.rs:82:17:
attempt to shift left with overflow

failures:
    tests_core::test_default_limits_allow_normal_patterns
    tests_operators::test_cidr_ipv4_basic
    tests_operators::test_cidr_ipv4_prefix_mask_boundary
    tests_operators::test_cidr_ipv4_prefix_various_lengths
    tests_operators::test_cidr_ipv4_various_prefixes
    tests_operators::test_cidr_miri_lightweight
    tests_operators::test_cidr_non_ip_values
    tests_operators::test_cidr_with_other_matchers

test result: FAILED. 642 passed; 8 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.17s

*** result: Failure(101)
