*** src/json.rs:82:30: replace - with / in CidrPattern::parse

*** mutation diff:
--- src/json.rs
+++ replace - with / in CidrPattern::parse
@@ -74,17 +74,17 @@
         if let Some(addr) = Self::parse_ipv4(addr_str) {
             if prefix_len > 32 {
                 return None;
             }
             // Apply mask to get network address
             let mask = if prefix_len == 0 {
                 0u32
             } else {
-                !0u32 << (32 - prefix_len)
+                !0u32 << (32 / /* ~ changed by cargo-mutants ~ */ prefix_len)
             };
             let network_bits = u32::from_be_bytes(addr) & mask;
             return Some(Self::V4 {
                 network: network_bits.to_be_bytes(),
                 prefix_len,
             });
         }

---- tests_operators::test_cidr_ipv4_prefix_mask_boundary stdout ----

thread 'tests_operators::test_cidr_ipv4_prefix_mask_boundary' (3056699) panicked at src/tests_operators.rs:675:5:
assertion `left == right` failed: 10.0.0.1 should match /32 with 10.0.0.1 (event: {"ip": "10.0.0.1"})
  left: []
 right: ["p32"]

failures:
    tests_operators::test_cidr_ipv4_prefix_mask_boundary

test result: FAILED. 649 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.12s

*** result: Failure(101)
