*** src/json.rs:93:27: replace > with < in CidrPattern::parse

*** mutation diff:
--- src/json.rs
+++ replace > with < in CidrPattern::parse
@@ -85,17 +85,17 @@
             return Some(Self::V4 {
                 network: network_bits.to_be_bytes(),
                 prefix_len,
             });
         }
 
         // Try IPv6
         if let Some(addr) = Self::parse_ipv6(addr_str) {
-            if prefix_len > 128 {
+            if prefix_len < /* ~ changed by cargo-mutants ~ */ 128 {
                 return None;
             }
             // Apply mask to get network address
             let network = Self::apply_ipv6_mask(&addr, prefix_len);
             return Some(Self::V6 {
                 network,
                 prefix_len,
             });

---- tests_operators::test_cidr_ipv6_basic stdout ----

thread 'tests_operators::test_cidr_ipv6_basic' (2814492) panicked at src/tests_operators.rs:2863:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8::/32")

failures:
    tests_operators::test_cidr_ipv6_basic

test result: FAILED. 646 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.21s

*** result: Failure(101)
