*** src/json.rs:93:27: replace > with >= in CidrPattern::parse

*** mutation diff:
--- src/json.rs
+++ replace > with >= in CidrPattern::parse
@@ -85,17 +85,17 @@
             return Some(Self::V4 {
                 network: network_bits.to_be_bytes(),
                 prefix_len,
             });
         }
 
         // Try IPv6
         if let Some(addr) = Self::parse_ipv6(addr_str) {
-            if prefix_len > 128 {
+            if prefix_len >= /* ~ changed by cargo-mutants ~ */ 128 {
                 return None;
             }
             // Apply mask to get network address
             let network = Self::apply_ipv6_mask(&addr, prefix_len);
             return Some(Self::V6 {
                 network,
                 prefix_len,
             });

---- tests_operators::test_cidr_ipv6_double_colon_variations stdout ----

thread 'tests_operators::test_cidr_ipv6_double_colon_variations' (3076058) panicked at src/tests_operators.rs:742:17:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8::1/128")

---- tests_operators::test_cidr_ipv6_group_limit stdout ----

thread 'tests_operators::test_cidr_ipv6_group_limit' (3076059) panicked at src/tests_operators.rs:764:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: 2001:db8:0:0:0:0:0:1/128")

---- tests_operators::test_cidr_ipv6_shorthand stdout ----

thread 'tests_operators::test_cidr_ipv6_shorthand' (3076061) panicked at src/tests_operators.rs:2974:13:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid CIDR notation: ::1/128")

failures:
    tests_operators::test_cidr_ipv6_double_colon_variations
    tests_operators::test_cidr_ipv6_group_limit
    tests_operators::test_cidr_ipv6_shorthand

test result: FAILED. 647 passed; 3 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.15s

*** result: Failure(101)
