*** src/regexp/nfa.rs:163:19: replace == with != in make_arena_nfa_from_branches

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace == with != in make_arena_nfa_from_branches
@@ -155,17 +155,17 @@
     root: &RegexpRoot,
     arena: &mut StateArena,
     next_step: StateId,
 ) -> StateId {
     if root.is_empty() {
         return next_step;
     }
 
-    if root.len() == 1 {
+    if root.len() != /* ~ changed by cargo-mutants ~ */ 1 {
         // Single branch - no alternation needed
         return make_one_arena_branch_fa(&root[0], arena, next_step);
     }
 
     // Multiple branches - create a start state with epsilons to each branch
     let mut branch_starts = Vec::with_capacity(root.len());
     for branch in root {
         if branch.is_empty() {

---- tests_core::test_arena_stats_workloads stdout ----

thread 'tests_core::test_arena_stats_workloads' (3534387) panicked at src/tests_core.rs:2762:9:
assertion `left == right` failed: 6-regexps-12-shell: state_count = 161, want 152
  left: 161
 right: 152

---- tests_operators::test_regex_alternation stdout ----

thread 'tests_operators::test_regex_alternation' (3534557) panicked at src/tests_operators.rs:581:5:
Expected "p1" in matches for {"a": "b"}, got []

---- tests_operators::test_regex_various_patterns stdout ----

thread 'tests_operators::test_regex_various_patterns' (3534560) panicked at src/tests_operators.rs:1406:13:
'a|b' should match 'b': expected "p1" in matches for {"a": "b"}, got []

failures:
    regexp::tests::test_negated_single_char_ascii_fast_path
    tests_core::test_arena_stats_workloads
    tests_operators::test_regex_alternation
    tests_operators::test_regex_various_patterns
    tests_operators::test_regexp_end2end
    tests_operators::test_regexp_validity
    tests_operators::test_wb_whole_word_at_end
    tests_operators::test_wb_whole_word_at_start
    tests_operators::test_wb_whole_word_only

test result: FAILED. 645 passed; 9 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.16s

*** result: Failure(101)
