*** src/regexp/nfa.rs:199:25: replace || with && in make_one_arena_branch_fa

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace || with && in make_one_arena_branch_fa
@@ -191,17 +191,17 @@
     next_step: StateId,
 ) -> StateId {
     let mut current_next = next_step;
 
     // Process atoms back to front
     for qa in branch.iter().rev() {
         let original_next = current_next;
 
-        if qa.is_plus() || qa.is_star() {
+        if qa.is_plus() && /* ~ changed by cargo-mutants ~ */ qa.is_star() {
             // Arena-based cyclic NFA for + and *
             current_next = create_arena_plus_star_loop(qa, arena, original_next, qa.is_star());
         } else if qa.is_qm() {
             // Optional: build atom FA with epsilon to skip
             let atom_state = make_arena_atom_fa(qa, arena, current_next);
             arena[atom_state].table.epsilons.push(original_next);
             current_next = atom_state;
         } else if qa.is_singleton() {

*** result: Timeout
