*** src/regexp/nfa.rs:216:18: replace == with != in make_one_arena_branch_fa

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace == with != in make_one_arena_branch_fa
@@ -208,17 +208,17 @@
             // No quantifier - simple FA
             current_next = make_arena_atom_fa(qa, arena, current_next);
         } else {
             // General {n,m} quantifier
             let n = qa.quant_min as usize;
             let m = qa.quant_max as usize;
 
             // Special case: {0,0} means match zero times - pure epsilon transition
-            if n == 0 && m == 0 {
+            if n != /* ~ changed by cargo-mutants ~ */ 0 && m == 0 {
                 let epsilon_state = arena.alloc();
                 arena[epsilon_state].table.epsilons.push(current_next);
                 current_next = epsilon_state;
                 continue;
             }
 
             // First, build the optional part (m-n copies, each with epsilon skip)
             for _ in n..m {

*** result: Success
