*** src/regexp/nfa.rs:216:28: replace == with != in make_one_arena_branch_fa

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace == with != in make_one_arena_branch_fa
@@ -208,17 +208,17 @@
             // No quantifier - simple FA
             current_next = make_arena_atom_fa(qa, arena, current_next);
         } else {
             // General {n,m} quantifier
             let n = qa.quant_min as usize;
             let m = qa.quant_max as usize;
 
             // Special case: {0,0} means match zero times - pure epsilon transition
-            if n == 0 && m == 0 {
+            if n == 0 && m != /* ~ changed by cargo-mutants ~ */ 0 {
                 let epsilon_state = arena.alloc();
                 arena[epsilon_state].table.epsilons.push(current_next);
                 current_next = epsilon_state;
                 continue;
             }
 
             // First, build the optional part (m-n copies, each with epsilon skip)
             for _ in n..m {

---- regexp::tests::test_multi_char_escape_with_quantifier stdout ----

thread 'regexp::tests::test_multi_char_escape_with_quantifier' (3551168) panicked at src/regexp/mod.rs:2258:9:
a~s{0,3}b should match 'a  b'

---- regexp::tests::test_nfa_range_zero_min stdout ----

thread 'regexp::tests::test_nfa_range_zero_min' (3551182) panicked at src/regexp/mod.rs:724:9:
Pattern a{0,2} should match 'a'

---- tests_operators::test_regexp_validity stdout ----

thread 'tests_operators::test_regexp_validity' (3551438) panicked at src/tests_operators.rs:2753:5:
Found 14 regexp validation problems (expected <= 4)

failures:
    regexp::tests::test_multi_char_escape_with_quantifier
    regexp::tests::test_nfa_range_zero_min
    tests_operators::test_regexp_validity

test result: FAILED. 651 passed; 3 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.21s

*** result: Failure(101)
