*** src/regexp/nfa.rs:299:22: replace == with != in make_arena_atom_fa

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace == with != in make_arena_atom_fa
@@ -291,17 +291,17 @@
 /// Build arena FA for a single atom.
 fn make_arena_atom_fa(qa: &QuantifiedAtom, arena: &mut StateArena, next: StateId) -> StateId {
     if qa.is_dot {
         make_arena_dot_fa(arena, next)
     } else if let Some(ref subtree) = qa.subtree {
         make_arena_nfa_from_branches(subtree, arena, next)
     } else if let Some(ref cache_key) = qa.cache_key {
         // Use compact non-word char FA for word boundary expansion
-        if cache_key == "wb_W" {
+        if cache_key != /* ~ changed by cargo-mutants ~ */ "wb_W" {
             return make_nonword_char_fa(arena, next);
         }
         make_cached_rune_range_fa(cache_key, &qa.runes, arena, next)
     } else {
         make_arena_rune_range_fa(&qa.runes, arena, next)
     }
 }

---- regexp::tests::test_shell_caching_independent_categories stdout ----

thread 'regexp::tests::test_shell_caching_independent_categories' (3555115) panicked at src/regexp/mod.rs:2445:9:
~p{L} should match 'A'

---- regexp::tests::test_shell_cache_instantiate_epsilon_remap stdout ----

thread 'regexp::tests::test_shell_cache_instantiate_epsilon_remap' (3555113) panicked at src/regexp/mod.rs:3043:9:
first NFA: 'Ax' should match

---- regexp::tests::test_shell_caching_negated_independent stdout ----

thread 'regexp::tests::test_shell_caching_negated_independent' (3555116) panicked at src/regexp/mod.rs:2506:9:
~p{L} should match 'A'

failures:
    regexp::tests::test_shell_cache_instantiate_epsilon_remap
    regexp::tests::test_shell_caching_independent_categories
    regexp::tests::test_shell_caching_negated_independent
    regexp::tests::test_shell_caching_nfa_correctness
    regexp::tests::test_xml_escapes_nfa
    tests_operators::test_regexp_validity
    tests_operators::test_wb_utf8_emoji_boundary
    tests_operators::test_wb_whole_word_at_end
    tests_operators::test_wb_whole_word_at_start
    tests_operators::test_wb_whole_word_match
    tests_operators::test_wb_whole_word_no_match
    tests_operators::test_wb_whole_word_only

test result: FAILED. 641 passed; 13 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.09s

*** result: Failure(101)
