*** src/regexp/nfa.rs:41:5: replace rune_to_utf8 -> Vec<u8> with vec![]

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace rune_to_utf8 -> Vec<u8> with vec![]
@@ -33,19 +33,17 @@
 const SURROGATE_END: u32 = 0xDFFF;
 
 // ============================================================================
 // Shared Utilities
 // ============================================================================
 
 /// Convert a rune to UTF-8 bytes.
 fn rune_to_utf8(r: char) -> Vec<u8> {
-    let mut buf = [0u8; 4];
-    let s = r.encode_utf8(&mut buf);
-    s.as_bytes().to_vec()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Check if a regexp tree has any `+` or `*` quantifiers that would benefit from arena-based NFA.
 pub fn regexp_has_plus_star(root: &RegexpRoot) -> bool {
     for branch in root {
         for qa in branch {
             if qa.is_plus() || qa.is_star() {
                 return true;

---- automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp' (3510938) panicked at src/automaton/mutable_matcher.rs:1627:9:
assertion `left == right` failed: Should match the pattern via matches_for_fields_direct
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp' (3510949) panicked at src/automaton/mutable_matcher.rs:1588:9:
assertion `left == right` failed: Should match the pattern
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus stdout ----

thread 'automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus' (3510958) panicked at src/automaton/mutable_matcher.rs:1559:9:
assertion `left == right` failed: Should match 'a'
  left: 0
 right: 1

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp
    automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus
    automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus
    regexp::tests::test_arena_nfa_email_pattern
    regexp::tests::test_arena_nfa_plus_simple
    regexp::tests::test_arena_nfa_star_plus_miri_friendly
    regexp::tests::test_clear_fa_shell_cache_works
    regexp::tests::test_multi_char_escape_with_quantifier
    regexp::tests::test_multi_char_escapes_nfa
    regexp::tests::test_negated_category_star_edge_cases
    regexp::tests::test_negated_class_nfa

test result: FAILED. 574 passed; 80 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.02s

*** result: Failure(101)
