*** src/regexp/nfa.rs:492:22: replace == with != in instantiate_shell

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace == with != in instantiate_shell
@@ -484,17 +484,17 @@
     id_map.push(next);
     // Allocate real states for all other locals
     for _ in 1..shell.tables.len() {
         id_map.push(arena.alloc());
     }
 
     // Clone each non-placeholder table, remapping all StateId references
     for (local_idx, src_table) in shell.tables.iter().enumerate() {
-        if local_idx == 0 {
+        if local_idx != /* ~ changed by cargo-mutants ~ */ 0 {
             // Placeholder — don't write into the real `next` state
             continue;
         }
 
         let real_id = id_map[local_idx];
         let mut table = src_table.clone();
 
         // Remap steps

---- regexp::tests::test_shell_cache_instantiate_epsilon_remap stdout ----

thread 'regexp::tests::test_shell_cache_instantiate_epsilon_remap' (3559046) panicked at src/regexp/mod.rs:3025:9:
first NFA: 'x' should match via epsilon skip

---- regexp::tests::test_shell_caching_nfa_correctness stdout ----

thread 'regexp::tests::test_shell_caching_nfa_correctness' (3559050) panicked at src/regexp/mod.rs:2384:9:
First ~p{L} should match 'A'

---- regexp::tests::test_shell_caching_independent_categories stdout ----

thread 'regexp::tests::test_shell_caching_independent_categories' (3559048) panicked at src/regexp/mod.rs:2445:9:
~p{L} should match 'A'

failures:
    regexp::tests::test_negated_category_star_edge_cases
    regexp::tests::test_shell_cache_instantiate_epsilon_remap
    regexp::tests::test_shell_caching_independent_categories
    regexp::tests::test_shell_caching_negated_independent
    regexp::tests::test_shell_caching_nfa_correctness
    regexp::tests::test_xml_escapes_nfa
    tests_operators::test_regexp_validity
    tests_operators::test_wb_utf8_emoji_boundary
    tests_operators::test_wb_with_dot

test result: FAILED. 645 passed; 9 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.08s

*** result: Failure(101)
