*** src/regexp/nfa.rs:502:16: delete ! in instantiate_shell

*** mutation diff:
--- src/regexp/nfa.rs
+++ delete ! in instantiate_shell
@@ -494,17 +494,17 @@
             continue;
         }
 
         let real_id = id_map[local_idx];
         let mut table = src_table.clone();
 
         // Remap steps
         for step in table.steps.iter_mut() {
-            if !step.is_none() {
+            if  /* ~ changed by cargo-mutants ~ */step.is_none() {
                 *step = id_map[step.index()];
             }
         }
 
         // Remap epsilons
         for eps in table.epsilons.iter_mut() {
             if !eps.is_none() {
                 *eps = id_map[eps.index()];

---- regexp::tests::test_shell_caching_negated_independent stdout ----

thread 'regexp::tests::test_shell_caching_negated_independent' (3562878) panicked at src/regexp/nfa.rs:503:31:
index out of bounds: the len is 1561 but the index is 4294967295

---- regexp::tests::test_shell_caching_nfa_correctness stdout ----

thread 'regexp::tests::test_shell_caching_nfa_correctness' (3562879) panicked at src/regexp/nfa.rs:503:31:
index out of bounds: the len is 1561 but the index is 4294967295

---- regexp::tests::test_shell_caching_independent_categories stdout ----

thread 'regexp::tests::test_shell_caching_independent_categories' (3562877) panicked at src/regexp/nfa.rs:503:31:
index out of bounds: the len is 1561 but the index is 4294967295

failures:
    regexp::tests::test_negated_category_star_edge_cases
    regexp::tests::test_shell_cache_instantiate_epsilon_remap
    regexp::tests::test_shell_caching_independent_categories
    regexp::tests::test_shell_caching_negated_independent
    regexp::tests::test_shell_caching_nfa_correctness
    regexp::tests::test_xml_escapes_nfa
    tests_operators::test_regexp_validity
    tests_operators::test_wb_utf8_emoji_boundary
    tests_operators::test_wb_with_dot

test result: FAILED. 645 passed; 9 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.17s

*** result: Failure(101)
