*** src/regexp/nfa.rs:50:29: replace || with && in regexp_has_plus_star

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace || with && in regexp_has_plus_star
@@ -42,17 +42,17 @@
     let s = r.encode_utf8(&mut buf);
     s.as_bytes().to_vec()
 }
 
 /// Check if a regexp tree has any `+` or `*` quantifiers that would benefit from arena-based NFA.
 pub fn regexp_has_plus_star(root: &RegexpRoot) -> bool {
     for branch in root {
         for qa in branch {
-            if qa.is_plus() || qa.is_star() {
+            if qa.is_plus() && /* ~ changed by cargo-mutants ~ */ qa.is_star() {
                 return true;
             }
             // Recursively check subtrees (parenthesized groups)
             if let Some(ref subtree) = qa.subtree {
                 if regexp_has_plus_star(subtree) {
                     return true;
                 }
             }

---- regexp::tests::test_arena_nfa_email_pattern stdout ----

thread 'regexp::tests::test_arena_nfa_email_pattern' (3530399) panicked at src/regexp/mod.rs:1065:9:
Pattern should be detected as having + quantifier

---- regexp::tests::test_toxic_stack_arena stdout ----

thread 'regexp::tests::test_toxic_stack_arena' (3530481) panicked at src/regexp/mod.rs:873:9:
Toxic pattern should have +/*

failures:
    regexp::tests::test_arena_nfa_email_pattern
    regexp::tests::test_toxic_stack_arena

test result: FAILED. 652 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.15s

*** result: Failure(101)
