*** src/regexp/nfa.rs:515:12: delete ! in instantiate_shell

*** mutation diff:
--- src/regexp/nfa.rs
+++ delete ! in instantiate_shell
@@ -507,17 +507,17 @@
         // Remap epsilons
         for eps in table.epsilons.iter_mut() {
             if !eps.is_none() {
                 *eps = id_map[eps.index()];
             }
         }
 
         // Remap default
-        if !table.default.is_none() {
+        if  /* ~ changed by cargo-mutants ~ */table.default.is_none() {
             table.default = id_map[table.default.index()];
         }
 
         arena[real_id].table = table;
     }
 
     id_map[shell.root as usize]
 }

---- regexp::tests::test_shell_caching_nfa_correctness stdout ----

thread 'regexp::tests::test_shell_caching_nfa_correctness' (3571367) panicked at src/regexp/nfa.rs:516:35:
index out of bounds: the len is 1561 but the index is 4294967295

---- regexp::tests::test_shell_caching_independent_categories stdout ----

thread 'regexp::tests::test_shell_caching_independent_categories' (3571365) panicked at src/regexp/nfa.rs:516:35:
index out of bounds: the len is 1561 but the index is 4294967295

---- regexp::tests::test_shell_caching_negated_independent stdout ----

thread 'regexp::tests::test_shell_caching_negated_independent' (3571366) panicked at src/regexp/nfa.rs:516:35:
index out of bounds: the len is 1561 but the index is 4294967295

failures:
    regexp::tests::test_negated_category_star_edge_cases
    regexp::tests::test_shell_cache_instantiate_epsilon_remap
    regexp::tests::test_shell_caching_independent_categories
    regexp::tests::test_shell_caching_negated_independent
    regexp::tests::test_shell_caching_nfa_correctness
    regexp::tests::test_xml_escapes_nfa
    tests_operators::test_regexp_validity
    tests_operators::test_wb_utf8_emoji_boundary
    tests_operators::test_wb_with_dot

test result: FAILED. 645 passed; 9 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.13s

*** result: Failure(101)
