*** src/regexp/nfa.rs:568:5: replace new_arena_rune_tree_node -> ArenaRuneTreeNode with Default::default()

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace new_arena_rune_tree_node -> ArenaRuneTreeNode with Default::default()
@@ -560,17 +560,17 @@
 struct ArenaRuneTreeEntry {
     next: Option<StateId>,
     child: Option<ArenaRuneTreeNode>,
 }
 
 type ArenaRuneTreeNode = Vec<Option<ArenaRuneTreeEntry>>;
 
 fn new_arena_rune_tree_node() -> ArenaRuneTreeNode {
-    (0..BYTE_CEILING).map(|_| None).collect()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn arena_nfa_from_rune_tree(arena: &mut StateArena, root: &ArenaRuneTreeNode) -> StateId {
     arena_table_from_rune_tree_node(arena, root)
 }
 
 fn arena_table_from_rune_tree_node(arena: &mut StateArena, node: &ArenaRuneTreeNode) -> StateId {
     let mut unpacked: [StateId; BYTE_CEILING] = [StateId::NONE; BYTE_CEILING];

---- automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp' (3579419) panicked at src/regexp/nfa.rs:812:12:
index out of bounds: the len is 0 but the index is 109

---- automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp' (3579430) panicked at src/regexp/nfa.rs:812:12:
index out of bounds: the len is 0 but the index is 109

---- automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus stdout ----

thread 'automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus' (3579438) panicked at src/regexp/nfa.rs:812:12:
index out of bounds: the len is 0 but the index is 109

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp
    automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus
    automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus
    regexp::tests::test_arena_nfa_email_pattern
    regexp::tests::test_arena_nfa_plus_simple
    regexp::tests::test_arena_nfa_star_plus_miri_friendly
    regexp::tests::test_clear_fa_shell_cache_works
    regexp::tests::test_multi_char_escape_with_quantifier
    regexp::tests::test_multi_char_escapes_nfa
    regexp::tests::test_negated_category_star_edge_cases
    regexp::tests::test_negated_class_nfa

test result: FAILED. 565 passed; 89 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.94s

*** result: Failure(101)
