*** src/regexp/nfa.rs:607:5: replace add_arena_rune_pair_tree_entry with ()

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace add_arena_rune_pair_tree_entry with ()
@@ -599,58 +599,17 @@
         add_arena_rune_pair_tree_entry(&mut root, pair.lo, pair.hi, next);
     }
 
     arena_nfa_from_rune_tree(arena, &root)
 }
 
 /// Add a range of runes [lo, hi] to the arena tree without iterating through each code point.
 fn add_arena_rune_pair_tree_entry(root: &mut ArenaRuneTreeNode, lo: char, hi: char, dest: StateId) {
-    let lo_u32 = lo as u32;
-    let hi_u32 = hi as u32;
-
-    let boundaries = [UTF8_1BYTE_MAX, UTF8_2BYTE_MAX, UTF8_3BYTE_MAX, u32::MAX];
-
-    let mut current = lo_u32;
-    for &boundary in &boundaries {
-        if current > hi_u32 {
-            break;
-        }
-
-        // Skip boundaries that are below current position
-        if boundary < current {
-            continue;
-        }
-
-        let segment_end = hi_u32.min(boundary);
-
-        if current <= SURROGATE_END && segment_end >= SURROGATE_START {
-            if current < SURROGATE_START {
-                let pre_end = (SURROGATE_START - 1).min(segment_end);
-                if let (Some(start), Some(end)) = (char::from_u32(current), char::from_u32(pre_end))
-                {
-                    add_arena_utf8_range_to_tree(root, start, end, dest);
-                }
-            }
-            if segment_end > SURROGATE_END {
-                let post_start = (SURROGATE_END + 1).max(current);
-                if let (Some(start), Some(end)) =
-                    (char::from_u32(post_start), char::from_u32(segment_end))
-                {
-                    add_arena_utf8_range_to_tree(root, start, end, dest);
-                }
-            }
-        } else if let (Some(start), Some(end)) =
-            (char::from_u32(current), char::from_u32(segment_end))
-        {
-            add_arena_utf8_range_to_tree(root, start, end, dest);
-        }
-
-        current = segment_end + 1;
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn add_arena_utf8_range_to_tree(root: &mut ArenaRuneTreeNode, lo: char, hi: char, dest: StateId) {
     let lo_bytes = rune_to_utf8(lo);
     let hi_bytes = rune_to_utf8(hi);
 
     debug_assert_eq!(lo_bytes.len(), hi_bytes.len());

---- automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp' (3583332) panicked at src/automaton/mutable_matcher.rs:1627:9:
assertion `left == right` failed: Should match the pattern via matches_for_fields_direct
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp' (3583343) panicked at src/automaton/mutable_matcher.rs:1588:9:
assertion `left == right` failed: Should match the pattern
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus stdout ----

thread 'automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus' (3583352) panicked at src/automaton/mutable_matcher.rs:1559:9:
assertion `left == right` failed: Should match 'a'
  left: 0
 right: 1

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp
    automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus
    automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus
    regexp::tests::test_arena_nfa_email_pattern
    regexp::tests::test_arena_nfa_plus_simple
    regexp::tests::test_arena_nfa_star_plus_miri_friendly
    regexp::tests::test_clear_fa_shell_cache_works
    regexp::tests::test_multi_char_escape_with_quantifier
    regexp::tests::test_multi_char_escapes_nfa
    regexp::tests::test_negated_category_star_edge_cases
    regexp::tests::test_negated_class_nfa

test result: FAILED. 574 passed; 80 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.09s

*** result: Failure(101)
