*** src/regexp/nfa.rs:614:20: replace > with >= in add_arena_rune_pair_tree_entry

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace > with >= in add_arena_rune_pair_tree_entry
@@ -606,17 +606,17 @@
 fn add_arena_rune_pair_tree_entry(root: &mut ArenaRuneTreeNode, lo: char, hi: char, dest: StateId) {
     let lo_u32 = lo as u32;
     let hi_u32 = hi as u32;
 
     let boundaries = [UTF8_1BYTE_MAX, UTF8_2BYTE_MAX, UTF8_3BYTE_MAX, u32::MAX];
 
     let mut current = lo_u32;
     for &boundary in &boundaries {
-        if current > hi_u32 {
+        if current >= /* ~ changed by cargo-mutants ~ */ hi_u32 {
             break;
         }
 
         // Skip boundaries that are below current position
         if boundary < current {
             continue;
         }

---- automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp' (3594859) panicked at src/automaton/mutable_matcher.rs:1627:9:
assertion `left == right` failed: Should match the pattern via matches_for_fields_direct
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp' (3594870) panicked at src/automaton/mutable_matcher.rs:1588:9:
assertion `left == right` failed: Should match the pattern
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus stdout ----

thread 'automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus' (3594878) panicked at src/automaton/mutable_matcher.rs:1517:9:
assertion `left == right` failed: Should match 'alice@example.com', got 0 results
  left: 0
 right: 1

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp
    automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus
    regexp::tests::test_arena_nfa_email_pattern
    regexp::tests::test_arena_nfa_star_plus_miri_friendly
    regexp::tests::test_multi_char_escape_with_quantifier
    regexp::tests::test_multi_char_escapes_nfa
    regexp::tests::test_nfa_range_bounded
    regexp::tests::test_nfa_range_exact
    regexp::tests::test_nfa_range_zero_min
    regexp::tests::test_range_quantifier_equivalence_plus
    regexp::tests::test_range_quantifier_equivalence_question

test result: FAILED. 592 passed; 62 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.11s

*** result: Failure(101)
