*** src/regexp/nfa.rs:619:21: replace < with == in add_arena_rune_pair_tree_entry

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace < with == in add_arena_rune_pair_tree_entry
@@ -611,17 +611,17 @@
 
     let mut current = lo_u32;
     for &boundary in &boundaries {
         if current > hi_u32 {
             break;
         }
 
         // Skip boundaries that are below current position
-        if boundary < current {
+        if boundary == /* ~ changed by cargo-mutants ~ */ current {
             continue;
         }
 
         let segment_end = hi_u32.min(boundary);
 
         if current <= SURROGATE_END && segment_end >= SURROGATE_START {
             if current < SURROGATE_START {
                 let pre_end = (SURROGATE_START - 1).min(segment_end);

---- regexp::tests::test_negated_category_star_edge_cases stdout ----

thread 'regexp::tests::test_negated_category_star_edge_cases' (3598863) panicked at src/regexp/nfa.rs:655:5:
assertion `left == right` failed
  left: 2
 right: 1

---- regexp::tests::test_negated_unicode_char_no_ascii_fast_path stdout ----

thread 'regexp::tests::test_negated_unicode_char_no_ascii_fast_path' (3598866) panicked at src/regexp/nfa.rs:655:5:
assertion `left == right` failed
  left: 2
 right: 1

---- regexp::tests::test_shell_cache_instantiate_epsilon_remap stdout ----

thread 'regexp::tests::test_shell_cache_instantiate_epsilon_remap' (3598917) panicked at src/regexp/nfa.rs:655:5:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    regexp::tests::test_negated_category_star_edge_cases
    regexp::tests::test_negated_class_nfa
    regexp::tests::test_negated_single_char_ascii_fast_path
    regexp::tests::test_negated_unicode_char_no_ascii_fast_path
    regexp::tests::test_shell_cache_instantiate_epsilon_remap
    regexp::tests::test_shell_caching_independent_categories
    regexp::tests::test_shell_caching_negated_independent
    regexp::tests::test_shell_caching_nfa_correctness
    regexp::tests::test_xml_escapes_nfa
    tests_operators::test_regexp_validity
    tests_operators::test_wb_utf8_multibyte

test result: FAILED. 643 passed; 11 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.01s

*** result: Failure(101)
