*** src/regexp/nfa.rs:619:21: replace < with > in add_arena_rune_pair_tree_entry

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace < with > in add_arena_rune_pair_tree_entry
@@ -611,17 +611,17 @@
 
     let mut current = lo_u32;
     for &boundary in &boundaries {
         if current > hi_u32 {
             break;
         }
 
         // Skip boundaries that are below current position
-        if boundary < current {
+        if boundary > /* ~ changed by cargo-mutants ~ */ current {
             continue;
         }
 
         let segment_end = hi_u32.min(boundary);
 
         if current <= SURROGATE_END && segment_end >= SURROGATE_START {
             if current < SURROGATE_START {
                 let pre_end = (SURROGATE_START - 1).min(segment_end);

---- automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp' (3602560) panicked at src/automaton/mutable_matcher.rs:1627:9:
assertion `left == right` failed: Should match the pattern via matches_for_fields_direct
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp' (3602571) panicked at src/automaton/mutable_matcher.rs:1588:9:
assertion `left == right` failed: Should match the pattern
  left: []
 right: ["p1"]

---- automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus stdout ----

thread 'automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus' (3602580) panicked at src/automaton/mutable_matcher.rs:1559:9:
assertion `left == right` failed: Should match 'a'
  left: 0
 right: 1

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp
    automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus
    automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus
    regexp::tests::test_arena_nfa_email_pattern
    regexp::tests::test_arena_nfa_plus_simple
    regexp::tests::test_arena_nfa_star_plus_miri_friendly
    regexp::tests::test_clear_fa_shell_cache_works
    regexp::tests::test_multi_char_escape_with_quantifier
    regexp::tests::test_multi_char_escapes_nfa
    regexp::tests::test_negated_category_star_edge_cases
    regexp::tests::test_negated_class_nfa

test result: FAILED. 573 passed; 81 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.03s

*** result: Failure(101)
