*** src/regexp/nfa.rs:619:21: replace < with <= in add_arena_rune_pair_tree_entry

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace < with <= in add_arena_rune_pair_tree_entry
@@ -611,17 +611,17 @@
 
     let mut current = lo_u32;
     for &boundary in &boundaries {
         if current > hi_u32 {
             break;
         }
 
         // Skip boundaries that are below current position
-        if boundary < current {
+        if boundary <= /* ~ changed by cargo-mutants ~ */ current {
             continue;
         }
 
         let segment_end = hi_u32.min(boundary);
 
         if current <= SURROGATE_END && segment_end >= SURROGATE_START {
             if current < SURROGATE_START {
                 let pre_end = (SURROGATE_START - 1).min(segment_end);

---- tests_operators::test_regexp_validity stdout ----

thread 'tests_operators::test_regexp_validity' (3606810) panicked at src/regexp/nfa.rs:655:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    tests_operators::test_regexp_validity

test result: FAILED. 653 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.16s

*** result: Failure(101)
