*** src/regexp/nfa.rs:626:24: replace < with == in add_arena_rune_pair_tree_entry

*** mutation diff:
--- src/regexp/nfa.rs
+++ replace < with == in add_arena_rune_pair_tree_entry
@@ -618,17 +618,17 @@
         // Skip boundaries that are below current position
         if boundary < current {
             continue;
         }
 
         let segment_end = hi_u32.min(boundary);
 
         if current <= SURROGATE_END && segment_end >= SURROGATE_START {
-            if current < SURROGATE_START {
+            if current == /* ~ changed by cargo-mutants ~ */ SURROGATE_START {
                 let pre_end = (SURROGATE_START - 1).min(segment_end);
                 if let (Some(start), Some(end)) = (char::from_u32(current), char::from_u32(pre_end))
                 {
                     add_arena_utf8_range_to_tree(root, start, end, dest);
                 }
             }
             if segment_end > SURROGATE_END {
                 let post_start = (SURROGATE_END + 1).max(current);

*** result: Success
