*** src/regexp/parser.rs:100:24: replace == with != in QuantifiedAtom::is_plus

*** mutation diff:
--- src/regexp/parser.rs
+++ replace == with != in QuantifiedAtom::is_plus
@@ -92,17 +92,17 @@
     #[inline]
     pub fn is_qm(&self) -> bool {
         self.quant_min == 0 && self.quant_max == 1
     }
 
     /// Returns true if this atom uses + (one or more).
     #[inline]
     pub fn is_plus(&self) -> bool {
-        self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
+        self.quant_min != /* ~ changed by cargo-mutants ~ */ 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 
     /// Returns true if this atom uses * (zero or more).
     #[inline]
     pub fn is_star(&self) -> bool {
         self.quant_min == 0 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 }

---- regexp::tests::test_arena_nfa_email_pattern stdout ----

thread 'regexp::tests::test_arena_nfa_email_pattern' (3415729) panicked at src/regexp/mod.rs:1065:9:
Pattern should be detected as having + quantifier

---- regexp::tests::test_parse_char_class_subtraction_no_overlap stdout ----

thread 'regexp::tests::test_parse_char_class_subtraction_no_overlap' (3415761) panicked at src/regexp/mod.rs:2756:9:
assertion failed: root[0][0].is_plus()

---- regexp::tests::test_parse_char_class_subtraction_single_chars_before_bracket stdout ----

thread 'regexp::tests::test_parse_char_class_subtraction_single_chars_before_bracket' (3415762) panicked at src/regexp/mod.rs:2800:9:
assertion failed: root[0][0].is_plus()

failures:
    regexp::tests::test_arena_nfa_email_pattern
    regexp::tests::test_negated_single_char_ascii_fast_path
    regexp::tests::test_parse_char_class_subtraction_no_overlap
    regexp::tests::test_parse_char_class_subtraction_single_chars_before_bracket
    regexp::tests::test_parse_lazy_quantifiers
    regexp::tests::test_parse_plus
    tests_core::test_arena_stats_workloads

test result: FAILED. 645 passed; 7 failed; 1 ignored; 0 measured; 0 filtered out; finished in 56.13s

*** result: Failure(101)
