*** src/regexp/parser.rs:100:29: replace && with || in QuantifiedAtom::is_plus

*** mutation diff:
--- src/regexp/parser.rs
+++ replace && with || in QuantifiedAtom::is_plus
@@ -92,17 +92,17 @@
     #[inline]
     pub fn is_qm(&self) -> bool {
         self.quant_min == 0 && self.quant_max == 1
     }
 
     /// Returns true if this atom uses + (one or more).
     #[inline]
     pub fn is_plus(&self) -> bool {
-        self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
+        self.quant_min == 1 || /* ~ changed by cargo-mutants ~ */ self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 
     /// Returns true if this atom uses * (zero or more).
     #[inline]
     pub fn is_star(&self) -> bool {
         self.quant_min == 0 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 }

---- regexp::tests::test_lookaround_atom_properties stdout ----

thread 'regexp::tests::test_lookaround_atom_properties' (3411855) panicked at src/regexp/mod.rs:295:48:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "variable-length lookbehind not yet supported: `(?<=a+)`; use fixed-length like `(?<=aaa)`", offset: 0 }

---- regexp::tests::test_parse_lookaround_supported stdout ----

thread 'regexp::tests::test_parse_lookaround_supported' (3411892) panicked at src/regexp/mod.rs:210:9:
Positive lookbehind should parse

---- regexp::tests::test_parse_variable_length_lookbehind_rejected stdout ----

thread 'regexp::tests::test_parse_variable_length_lookbehind_rejected' (3411903) panicked at src/regexp/mod.rs:265:9:
Fixed-length lookbehind should parse

failures:
    regexp::tests::test_lookaround_atom_properties
    regexp::tests::test_parse_lookaround_supported
    regexp::tests::test_parse_variable_length_lookbehind_rejected
    regexp::tests::test_range_quantifier_exact_one
    regexp::tests::test_regexp_has_plus_star_returns_false
    tests_core::test_arena_stats_workloads
    tests_operators::test_lookaround_pattern_parsing
    tests_operators::test_lookbehind_match
    tests_operators::test_negative_lookbehind_match
    tests_operators::test_regexp_end2end
    tests_operators::test_regexp_validity

test result: FAILED. 641 passed; 11 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.14s

*** result: Failure(101)
