*** src/regexp/parser.rs:100:47: replace == with != in QuantifiedAtom::is_plus

*** mutation diff:
--- src/regexp/parser.rs
+++ replace == with != in QuantifiedAtom::is_plus
@@ -92,17 +92,17 @@
     #[inline]
     pub fn is_qm(&self) -> bool {
         self.quant_min == 0 && self.quant_max == 1
     }
 
     /// Returns true if this atom uses + (one or more).
     #[inline]
     pub fn is_plus(&self) -> bool {
-        self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
+        self.quant_min == 1 && self.quant_max != /* ~ changed by cargo-mutants ~ */ REGEXP_QUANTIFIER_MAX
     }
 
     /// Returns true if this atom uses * (zero or more).
     #[inline]
     pub fn is_star(&self) -> bool {
         self.quant_min == 0 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 }

---- regexp::tests::test_lookaround_atom_properties stdout ----

thread 'regexp::tests::test_lookaround_atom_properties' (3420337) panicked at src/regexp/mod.rs:295:48:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "variable-length lookbehind not yet supported: `(?<=a+)`; use fixed-length like `(?<=aaa)`", offset: 0 }

---- regexp::tests::test_parse_char_class_subtraction_no_overlap stdout ----

thread 'regexp::tests::test_parse_char_class_subtraction_no_overlap' (3420363) panicked at src/regexp/mod.rs:2756:9:
assertion failed: root[0][0].is_plus()

---- regexp::tests::test_parse_char_class_subtraction_single_chars_before_bracket stdout ----

thread 'regexp::tests::test_parse_char_class_subtraction_single_chars_before_bracket' (3420364) panicked at src/regexp/mod.rs:2800:9:
assertion failed: root[0][0].is_plus()

failures:
    regexp::tests::test_lookaround_atom_properties
    regexp::tests::test_negated_single_char_ascii_fast_path
    regexp::tests::test_parse_char_class_subtraction_no_overlap
    regexp::tests::test_parse_char_class_subtraction_single_chars_before_bracket
    regexp::tests::test_parse_lazy_quantifiers
    regexp::tests::test_parse_lookaround_supported
    regexp::tests::test_parse_plus
    regexp::tests::test_parse_variable_length_lookbehind_rejected
    regexp::tests::test_range_quantifier_exact_one
    regexp::tests::test_regexp_has_plus_star_returns_false
    tests_core::test_arena_stats_workloads
    tests_operators::test_lookaround_pattern_parsing

test result: FAILED. 636 passed; 16 failed; 1 ignored; 0 measured; 0 filtered out; finished in 13.24s

*** result: Failure(101)
