*** src/regexp/parser.rs:100:9: replace QuantifiedAtom::is_plus -> bool with true

*** mutation diff:
--- src/regexp/parser.rs
+++ replace QuantifiedAtom::is_plus -> bool with true
@@ -92,17 +92,17 @@
     #[inline]
     pub fn is_qm(&self) -> bool {
         self.quant_min == 0 && self.quant_max == 1
     }
 
     /// Returns true if this atom uses + (one or more).
     #[inline]
     pub fn is_plus(&self) -> bool {
-        self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns true if this atom uses * (zero or more).
     #[inline]
     pub fn is_star(&self) -> bool {
         self.quant_min == 0 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 }

---- regexp::tests::test_lookaround_atom_properties stdout ----

thread 'regexp::tests::test_lookaround_atom_properties' (3403004) panicked at src/regexp/mod.rs:295:48:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "variable-length lookbehind not yet supported: `(?<=a+)`; use fixed-length like `(?<=aaa)`", offset: 0 }

---- regexp::tests::test_multi_char_escape_with_quantifier stdout ----

thread 'regexp::tests::test_multi_char_escape_with_quantifier' (3403005) panicked at src/regexp/mod.rs:2247:9:
a~s{0,3}b should match 'ab'

---- regexp::tests::test_nfa_range_bounded stdout ----

thread 'regexp::tests::test_nfa_range_bounded' (3403016) panicked at src/regexp/mod.rs:577:9:
Pattern a{2,4} should NOT match 'a'

failures:
    regexp::tests::test_lookaround_atom_properties
    regexp::tests::test_multi_char_escape_with_quantifier
    regexp::tests::test_nfa_range_bounded
    regexp::tests::test_nfa_range_exact
    regexp::tests::test_nfa_range_with_class
    regexp::tests::test_nfa_range_zero_min
    regexp::tests::test_parse_lookaround_supported
    regexp::tests::test_parse_variable_length_lookbehind_rejected
    regexp::tests::test_range_quantifier_equivalence_question
    regexp::tests::test_range_quantifier_exact_one
    regexp::tests::test_range_quantifier_exact_zero
    regexp::tests::test_range_quantifier_larger_values

test result: FAILED. 628 passed; 24 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.29s

*** result: Failure(101)
