*** src/regexp/parser.rs:106:24: replace == with != in QuantifiedAtom::is_star

*** mutation diff:
--- src/regexp/parser.rs
+++ replace == with != in QuantifiedAtom::is_star
@@ -98,17 +98,17 @@
     #[inline]
     pub fn is_plus(&self) -> bool {
         self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 
     /// Returns true if this atom uses * (zero or more).
     #[inline]
     pub fn is_star(&self) -> bool {
-        self.quant_min == 0 && self.quant_max == REGEXP_QUANTIFIER_MAX
+        self.quant_min != /* ~ changed by cargo-mutants ~ */ 0 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 }
 
 /// A branch in the regexp (sequence of atoms).
 pub type RegexpBranch = Vec<QuantifiedAtom>;
 
 /// The root of a parsed regexp (alternatives separated by |).
 pub type RegexpRoot = Vec<RegexpBranch>;

---- regexp::tests::test_nfa_plus_quantifier stdout ----

thread 'regexp::tests::test_nfa_plus_quantifier' (3437233) panicked at src/regexp/mod.rs:416:9:
Pattern [abc]+ should NOT match empty string

---- regexp::tests::test_parse_lazy_quantifiers stdout ----

thread 'regexp::tests::test_parse_lazy_quantifiers' (3437258) panicked at src/regexp/mod.rs:178:9:
Should be star quantifier

---- regexp::tests::test_parse_star stdout ----

thread 'regexp::tests::test_parse_star' (3437268) panicked at src/regexp/mod.rs:130:9:
Should be recognized as star quantifier

failures:
    regexp::tests::test_arena_nfa_star_plus_miri_friendly
    regexp::tests::test_negated_single_char_ascii_fast_path
    regexp::tests::test_nfa_plus_quantifier
    regexp::tests::test_parse_lazy_quantifiers
    regexp::tests::test_parse_star
    regexp::tests::test_range_quantifier_equivalence_plus
    tests_core::test_arena_stats_workloads
    tests_operators::test_regexp_validity
    tests_stress::test_pathological_correctness

test result: FAILED. 643 passed; 9 failed; 1 ignored; 0 measured; 0 filtered out; finished in 58.56s

*** result: Failure(101)
