*** src/regexp/parser.rs:106:29: replace && with || in QuantifiedAtom::is_star

*** mutation diff:
--- src/regexp/parser.rs
+++ replace && with || in QuantifiedAtom::is_star
@@ -98,17 +98,17 @@
     #[inline]
     pub fn is_plus(&self) -> bool {
         self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 
     /// Returns true if this atom uses * (zero or more).
     #[inline]
     pub fn is_star(&self) -> bool {
-        self.quant_min == 0 && self.quant_max == REGEXP_QUANTIFIER_MAX
+        self.quant_min == 0 || /* ~ changed by cargo-mutants ~ */ self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 }
 
 /// A branch in the regexp (sequence of atoms).
 pub type RegexpBranch = Vec<QuantifiedAtom>;
 
 /// The root of a parsed regexp (alternatives separated by |).
 pub type RegexpRoot = Vec<RegexpBranch>;

---- regexp::tests::test_arena_nfa_star_plus_miri_friendly stdout ----

thread 'regexp::tests::test_arena_nfa_star_plus_miri_friendly' (3433296) panicked at src/regexp/mod.rs:1158:9:
[abc]+ should not match empty

---- regexp::tests::test_nfa_plus_quantifier stdout ----

thread 'regexp::tests::test_nfa_plus_quantifier' (3433310) panicked at src/regexp/mod.rs:416:9:
Pattern [abc]+ should NOT match empty string

---- regexp::tests::test_nfa_range_zero_min stdout ----

thread 'regexp::tests::test_nfa_range_zero_min' (3433315) panicked at src/regexp/mod.rs:746:9:
Pattern a{0,2} should NOT match 'aaa'

failures:
    regexp::tests::test_arena_nfa_star_plus_miri_friendly
    regexp::tests::test_negated_single_char_ascii_fast_path
    regexp::tests::test_nfa_plus_quantifier
    regexp::tests::test_nfa_range_zero_min
    regexp::tests::test_range_quantifier_equivalence_plus
    regexp::tests::test_range_quantifier_equivalence_question
    regexp::tests::test_range_quantifier_exact_zero
    regexp::tests::test_zero_quantifier
    tests_core::test_arena_stats_workloads
    tests_operators::test_regexp_simple_optional
    tests_operators::test_regexp_validity

test result: FAILED. 641 passed; 11 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.11s

*** result: Failure(101)
