*** src/regexp/parser.rs:106:47: replace == with != in QuantifiedAtom::is_star

*** mutation diff:
--- src/regexp/parser.rs
+++ replace == with != in QuantifiedAtom::is_star
@@ -98,17 +98,17 @@
     #[inline]
     pub fn is_plus(&self) -> bool {
         self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 
     /// Returns true if this atom uses * (zero or more).
     #[inline]
     pub fn is_star(&self) -> bool {
-        self.quant_min == 0 && self.quant_max == REGEXP_QUANTIFIER_MAX
+        self.quant_min == 0 && self.quant_max != /* ~ changed by cargo-mutants ~ */ REGEXP_QUANTIFIER_MAX
     }
 }
 
 /// A branch in the regexp (sequence of atoms).
 pub type RegexpBranch = Vec<QuantifiedAtom>;
 
 /// The root of a parsed regexp (alternatives separated by |).
 pub type RegexpRoot = Vec<RegexpBranch>;

---- regexp::tests::test_nfa_range_zero_min stdout ----

thread 'regexp::tests::test_nfa_range_zero_min' (3442274) panicked at src/regexp/mod.rs:746:9:
Pattern a{0,2} should NOT match 'aaa'

---- regexp::tests::test_parse_lazy_quantifiers stdout ----

thread 'regexp::tests::test_parse_lazy_quantifiers' (3442294) panicked at src/regexp/mod.rs:178:9:
Should be star quantifier

---- regexp::tests::test_parse_star stdout ----

thread 'regexp::tests::test_parse_star' (3442304) panicked at src/regexp/mod.rs:130:9:
Should be recognized as star quantifier

failures:
    regexp::tests::test_nfa_range_zero_min
    regexp::tests::test_parse_lazy_quantifiers
    regexp::tests::test_parse_star
    regexp::tests::test_range_quantifier_equivalence_question
    regexp::tests::test_range_quantifier_exact_zero
    regexp::tests::test_zero_quantifier
    tests_core::test_arena_stats_workloads
    tests_operators::test_regexp_simple_optional
    tests_operators::test_regexp_validity
    tests_stress::test_pathological_correctness

test result: FAILED. 642 passed; 10 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.13s

*** result: Failure(101)
