*** src/regexp/parser.rs:106:9: replace QuantifiedAtom::is_star -> bool with true

*** mutation diff:
--- src/regexp/parser.rs
+++ replace QuantifiedAtom::is_star -> bool with true
@@ -98,17 +98,17 @@
     #[inline]
     pub fn is_plus(&self) -> bool {
         self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 
     /// Returns true if this atom uses * (zero or more).
     #[inline]
     pub fn is_star(&self) -> bool {
-        self.quant_min == 0 && self.quant_max == REGEXP_QUANTIFIER_MAX
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A branch in the regexp (sequence of atoms).
 pub type RegexpBranch = Vec<QuantifiedAtom>;
 
 /// The root of a parsed regexp (alternatives separated by |).
 pub type RegexpRoot = Vec<RegexpBranch>;

---- regexp::tests::test_arena_nfa_star_plus_miri_friendly stdout ----

thread 'regexp::tests::test_arena_nfa_star_plus_miri_friendly' (3424380) panicked at src/regexp/mod.rs:1158:9:
[abc]+ should not match empty

---- regexp::tests::test_lookaround_atom_properties stdout ----

thread 'regexp::tests::test_lookaround_atom_properties' (3424384) panicked at src/regexp/mod.rs:295:48:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "variable-length lookbehind not yet supported: `(?<=a+)`; use fixed-length like `(?<=aaa)`", offset: 0 }

---- regexp::tests::test_nfa_plus_quantifier stdout ----

thread 'regexp::tests::test_nfa_plus_quantifier' (3424394) panicked at src/regexp/mod.rs:416:9:
Pattern [abc]+ should NOT match empty string

failures:
    regexp::tests::test_arena_nfa_star_plus_miri_friendly
    regexp::tests::test_lookaround_atom_properties
    regexp::tests::test_negated_single_char_ascii_fast_path
    regexp::tests::test_nfa_plus_quantifier
    regexp::tests::test_nfa_range_bounded
    regexp::tests::test_nfa_range_exact
    regexp::tests::test_nfa_range_with_class
    regexp::tests::test_nfa_range_zero_min
    regexp::tests::test_parse_lookaround_supported
    regexp::tests::test_parse_variable_length_lookbehind_rejected
    regexp::tests::test_range_quantifier_equivalence_plus
    regexp::tests::test_range_quantifier_equivalence_question

test result: FAILED. 618 passed; 34 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.03s

*** result: Failure(101)
