*** src/regexp/parser.rs:106:9: replace QuantifiedAtom::is_star -> bool with false

*** mutation diff:
--- src/regexp/parser.rs
+++ replace QuantifiedAtom::is_star -> bool with false
@@ -98,17 +98,17 @@
     #[inline]
     pub fn is_plus(&self) -> bool {
         self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }
 
     /// Returns true if this atom uses * (zero or more).
     #[inline]
     pub fn is_star(&self) -> bool {
-        self.quant_min == 0 && self.quant_max == REGEXP_QUANTIFIER_MAX
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A branch in the regexp (sequence of atoms).
 pub type RegexpBranch = Vec<QuantifiedAtom>;
 
 /// The root of a parsed regexp (alternatives separated by |).
 pub type RegexpRoot = Vec<RegexpBranch>;

---- regexp::tests::test_parse_lazy_quantifiers stdout ----

thread 'regexp::tests::test_parse_lazy_quantifiers' (3428365) panicked at src/regexp/mod.rs:178:9:
Should be star quantifier

---- regexp::tests::test_parse_star stdout ----

thread 'regexp::tests::test_parse_star' (3428375) panicked at src/regexp/mod.rs:130:9:
Should be recognized as star quantifier

---- tests_core::test_arena_stats_workloads stdout ----

thread 'tests_core::test_arena_stats_workloads' (3428423) panicked at src/tests_core.rs:2744:50:
called `Result::unwrap()` on an `Err` value: PatternTooComplex("automaton byte size (330334208 bytes) exceeds budget (10485760 bytes)")

failures:
    regexp::tests::test_parse_lazy_quantifiers
    regexp::tests::test_parse_star
    tests_core::test_arena_stats_workloads
    tests_stress::test_pathological_correctness

test result: FAILED. 648 passed; 4 failed; 1 ignored; 0 measured; 0 filtered out; finished in 59.23s

*** result: Failure(101)
