*** src/regexp/parser.rs:137:9: replace LookaroundType::is_lookbehind -> bool with false

*** mutation diff:
--- src/regexp/parser.rs
+++ replace LookaroundType::is_lookbehind -> bool with false
@@ -129,17 +129,17 @@
 impl LookaroundType {
     /// Returns true if this is a negative lookaround ((?!...) or (?<!...))
     pub fn is_negative(&self) -> bool {
         matches!(self, Self::NegativeLookahead | Self::NegativeLookbehind)
     }
 
     /// Returns true if this is a lookbehind ((?<=...) or (?<!...))
     pub fn is_lookbehind(&self) -> bool {
-        matches!(self, Self::PositiveLookbehind | Self::NegativeLookbehind)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Features found during parsing (for validation).
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub enum RegexpFeature {
     Dot,
     Star,

---- regexp::tests::test_parse_variable_length_lookbehind_rejected stdout ----

thread 'regexp::tests::test_parse_variable_length_lookbehind_rejected' (3459894) panicked at src/regexp/mod.rs:252:9:
Variable-length lookbehind (plus) should fail

---- tests_operators::test_lookaround_rejected_patterns stdout ----

thread 'tests_operators::test_lookaround_rejected_patterns' (3460088) panicked at src/tests_operators.rs:3082:5:
Variable-length lookbehind should be rejected

failures:
    regexp::tests::test_parse_variable_length_lookbehind_rejected
    tests_operators::test_lookaround_rejected_patterns

test result: FAILED. 650 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.11s

*** result: Failure(101)
