*** src/regexp/parser.rs:218:9: replace RegexpParse::nest with ()

*** mutation diff:
--- src/regexp/parser.rs
+++ replace RegexpParse::nest with ()
@@ -210,17 +210,17 @@
             last_index: 0,
             nesting: Vec::new(),
             found_features: Vec::new(),
             tree: Vec::new(),
         }
     }
 
     fn nest(&mut self) {
-        self.nesting.push(std::mem::take(&mut self.tree));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn unnest(&mut self) -> RegexpRoot {
         let subtree = std::mem::take(&mut self.tree);
         self.tree = self.nesting.pop().unwrap_or_default();
         subtree
     }

---- regexp::tests::test_lookaround_atom_properties stdout ----

thread 'regexp::tests::test_lookaround_atom_properties' (3468427) panicked at src/regexp/mod.rs:278:47:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "unbalanced ')'", offset: 9 }

---- regexp::tests::test_backreferences_not_supported stdout ----

thread 'regexp::tests::test_backreferences_not_supported' (3468424) panicked at src/regexp/mod.rs:2614:13:
Error for '(.)~1' should mention backreference: unbalanced ')'

---- regexp::tests::test_parse_char_class_subtraction_alternation stdout ----

thread 'regexp::tests::test_parse_char_class_subtraction_alternation' (3468448) panicked at src/regexp/mod.rs:2806:67:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "unbalanced ')'", offset: 28 }

failures:
    regexp::tests::test_backreferences_not_supported
    regexp::tests::test_lookaround_atom_properties
    regexp::tests::test_parse_char_class_subtraction_alternation
    regexp::tests::test_parse_group
    regexp::tests::test_parse_lookaround_supported
    regexp::tests::test_parse_non_capturing_group
    regexp::tests::test_parse_non_capturing_nested
    regexp::tests::test_parse_variable_length_lookbehind_rejected
    regexp::tests::test_range_quantifier_with_group
    regexp::tests::test_star_matches_empty
    regexp::tests::test_toxic_stack_arena
    tests_core::test_arena_stats_workloads

test result: FAILED. 622 passed; 30 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.40s

*** result: Failure(101)
