*** src/regexp/parser.rs:222:9: replace RegexpParse::unnest -> RegexpRoot with Default::default()

*** mutation diff:
--- src/regexp/parser.rs
+++ replace RegexpParse::unnest -> RegexpRoot with Default::default()
@@ -214,19 +214,17 @@
         }
     }
 
     fn nest(&mut self) {
         self.nesting.push(std::mem::take(&mut self.tree));
     }
 
     fn unnest(&mut self) -> RegexpRoot {
-        let subtree = std::mem::take(&mut self.tree);
-        self.tree = self.nesting.pop().unwrap_or_default();
-        subtree
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_nested(&self) -> bool {
         !self.nesting.is_empty()
     }
 
     fn next_rune(&mut self) -> Result<char, RegexpError> {
         if self.index >= self.bytes.len() {

---- regexp::tests::test_lookaround_atom_properties stdout ----

thread 'regexp::tests::test_lookaround_atom_properties' (3472344) panicked at src/regexp/mod.rs:278:47:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "unclosed '('", offset: 10 }

---- regexp::tests::test_parse_char_class_subtraction_alternation stdout ----

thread 'regexp::tests::test_parse_char_class_subtraction_alternation' (3472365) panicked at src/regexp/mod.rs:2806:67:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "unclosed '('", offset: 30 }

---- regexp::tests::test_parse_group stdout ----

thread 'regexp::tests::test_parse_group' (3472377) panicked at src/regexp/mod.rs:90:43:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "unclosed '('", offset: 6 }

failures:
    regexp::tests::test_lookaround_atom_properties
    regexp::tests::test_parse_char_class_subtraction_alternation
    regexp::tests::test_parse_group
    regexp::tests::test_parse_lookaround_supported
    regexp::tests::test_parse_non_capturing_group
    regexp::tests::test_parse_non_capturing_nested
    regexp::tests::test_parse_variable_length_lookbehind_rejected
    regexp::tests::test_range_quantifier_with_group
    regexp::tests::test_star_matches_empty
    regexp::tests::test_toxic_stack_arena
    tests_core::test_arena_stats_workloads
    tests_operators::test_exact_added_before_lookahead_on_same_field

test result: FAILED. 623 passed; 29 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.31s

*** result: Failure(101)
