*** src/regexp/parser.rs:228:9: replace RegexpParse::is_nested -> bool with true

*** mutation diff:
--- src/regexp/parser.rs
+++ replace RegexpParse::is_nested -> bool with true
@@ -220,17 +220,17 @@
 
     fn unnest(&mut self) -> RegexpRoot {
         let subtree = std::mem::take(&mut self.tree);
         self.tree = self.nesting.pop().unwrap_or_default();
         subtree
     }
 
     fn is_nested(&self) -> bool {
-        !self.nesting.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn next_rune(&mut self) -> Result<char, RegexpError> {
         if self.index >= self.bytes.len() {
             return Err(RegexpError {
                 message: "end of string".into(),
                 offset: self.index,
             });

---- automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp' (3476187) panicked at src/automaton/mutable_matcher.rs:1612:88:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid regexp: unclosed '('")

---- automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp' (3476198) panicked at src/automaton/mutable_matcher.rs:1574:88:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid regexp: unclosed '('")

---- automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus stdout ----

thread 'automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus' (3476206) panicked at src/automaton/mutable_matcher.rs:1502:63:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "unclosed '('", offset: 19 }

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp
    automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus
    automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus
    regexp::parser::tests::test_parse_negated_char_class_stores_ascii_bytes
    regexp::parser::tests::test_parse_negated_quote_class
    regexp::parser::tests::test_parse_negated_slash_class
    regexp::parser::tests::test_parse_negated_unicode_class_no_ascii_bytes
    regexp::parser::tests::test_parse_non_negated_class_no_ascii_bytes
    regexp::parser::tests::test_wb_dot_star_expansion
    regexp::parser::tests::test_wb_impossible_boundary_empty_tree
    regexp::parser::tests::test_wb_middle_boundary_expansion

test result: FAILED. 516 passed; 136 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.90s

*** result: Failure(101)
