*** src/regexp/parser.rs:228:9: replace RegexpParse::is_nested -> bool with false

*** mutation diff:
--- src/regexp/parser.rs
+++ replace RegexpParse::is_nested -> bool with false
@@ -220,17 +220,17 @@
 
     fn unnest(&mut self) -> RegexpRoot {
         let subtree = std::mem::take(&mut self.tree);
         self.tree = self.nesting.pop().unwrap_or_default();
         subtree
     }
 
     fn is_nested(&self) -> bool {
-        !self.nesting.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn next_rune(&mut self) -> Result<char, RegexpError> {
         if self.index >= self.bytes.len() {
             return Err(RegexpError {
                 message: "end of string".into(),
                 offset: self.index,
             });

---- regexp::tests::test_backreferences_not_supported stdout ----

thread 'regexp::tests::test_backreferences_not_supported' (3480201) panicked at src/regexp/mod.rs:2614:13:
Error for '(.)~1' should mention backreference: unbalanced ')'

---- regexp::tests::test_lookaround_atom_properties stdout ----

thread 'regexp::tests::test_lookaround_atom_properties' (3480204) panicked at src/regexp/mod.rs:278:47:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "unbalanced ')'", offset: 9 }

---- regexp::tests::test_parse_char_class_subtraction_alternation stdout ----

thread 'regexp::tests::test_parse_char_class_subtraction_alternation' (3480225) panicked at src/regexp/mod.rs:2806:67:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "unbalanced ')'", offset: 28 }

failures:
    regexp::tests::test_backreferences_not_supported
    regexp::tests::test_lookaround_atom_properties
    regexp::tests::test_parse_char_class_subtraction_alternation
    regexp::tests::test_parse_group
    regexp::tests::test_parse_lookaround_supported
    regexp::tests::test_parse_non_capturing_group
    regexp::tests::test_parse_non_capturing_nested
    regexp::tests::test_parse_variable_length_lookbehind_rejected
    regexp::tests::test_range_quantifier_with_group
    regexp::tests::test_star_matches_empty
    regexp::tests::test_toxic_stack_arena
    tests_core::test_arena_stats_workloads

test result: FAILED. 622 passed; 30 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.12s

*** result: Failure(101)
