*** src/regexp/parser.rs:232:23: replace >= with < in RegexpParse::next_rune

*** mutation diff:
--- src/regexp/parser.rs
+++ replace >= with < in RegexpParse::next_rune
@@ -224,17 +224,17 @@
         subtree
     }
 
     fn is_nested(&self) -> bool {
         !self.nesting.is_empty()
     }
 
     fn next_rune(&mut self) -> Result<char, RegexpError> {
-        if self.index >= self.bytes.len() {
+        if self.index < /* ~ changed by cargo-mutants ~ */ self.bytes.len() {
             return Err(RegexpError {
                 message: "end of string".into(),
                 offset: self.index,
             });
         }
         self.last_index = self.index;
 
         // Decode UTF-8

---- automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp' (3491774) panicked at src/automaton/mutable_matcher.rs:1612:88:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid regexp: end of string")

---- automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp' (3491785) panicked at src/automaton/mutable_matcher.rs:1574:88:
called `Result::unwrap()` on an `Err` value: InvalidPattern("invalid regexp: end of string")

---- automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus stdout ----

thread 'automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus' (3491793) panicked at src/automaton/mutable_matcher.rs:1502:63:
called `Result::unwrap()` on an `Err` value: RegexpError { message: "end of string", offset: 0 }

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp
    automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus
    automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus
    regexp::parser::tests::test_parse_negated_char_class_stores_ascii_bytes
    regexp::parser::tests::test_parse_negated_quote_class
    regexp::parser::tests::test_parse_negated_slash_class
    regexp::parser::tests::test_parse_negated_unicode_class_no_ascii_bytes
    regexp::parser::tests::test_parse_non_negated_class_no_ascii_bytes
    regexp::parser::tests::test_wb_dot_star_expansion
    regexp::parser::tests::test_wb_impossible_boundary_empty_tree
    regexp::parser::tests::test_wb_middle_boundary_expansion

test result: FAILED. 517 passed; 135 failed; 1 ignored; 0 measured; 0 filtered out; finished in 6.99s

*** result: Failure(101)
