*** src/regexp/parser.rs:232:9: replace RegexpParse::next_rune -> Result<char, RegexpError> with Ok(Default::default())

*** mutation diff:
--- src/regexp/parser.rs
+++ replace RegexpParse::next_rune -> Result<char, RegexpError> with Ok(Default::default())
@@ -224,38 +224,17 @@
         subtree
     }
 
     fn is_nested(&self) -> bool {
         !self.nesting.is_empty()
     }
 
     fn next_rune(&mut self) -> Result<char, RegexpError> {
-        if self.index >= self.bytes.len() {
-            return Err(RegexpError {
-                message: "end of string".into(),
-                offset: self.index,
-            });
-        }
-        self.last_index = self.index;
-
-        // Decode UTF-8
-        let remaining = &self.bytes[self.index..];
-        let s = std::str::from_utf8(remaining).map_err(|_| RegexpError {
-            message: "UTF-8 encoding error".into(),
-            offset: self.index,
-        })?;
-
-        let c = s.chars().next().ok_or_else(|| RegexpError {
-            message: "empty string".into(),
-            offset: self.index,
-        })?;
-
-        self.index += c.len_utf8();
-        Ok(c)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn require(&mut self, wanted: char) -> Result<(), RegexpError> {
         let got = self.next_rune()?;
         if got != wanted {
             return Err(RegexpError {
                 message: format!("expected '{}', got '{}'", wanted, got),
                 offset: self.last_index,

---- automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp' (3487724) panicked at src/regexp/parser.rs:255:9:
attempt to subtract with overflow

---- automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp stdout ----

thread 'automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp' (3487735) panicked at src/regexp/parser.rs:255:9:
attempt to subtract with overflow

---- automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus stdout ----

thread 'automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus' (3487743) panicked at src/regexp/parser.rs:255:9:
attempt to subtract with overflow

failures:
    automaton::mutable_matcher::tests::test_core_matcher_direct_with_arena_regexp
    automaton::mutable_matcher::tests::test_core_matcher_with_arena_regexp
    automaton::mutable_matcher::tests::test_value_matcher_regexp_with_plus
    automaton::mutable_matcher::tests::test_value_matcher_regexp_without_plus
    regexp::parser::tests::test_parse_negated_char_class_stores_ascii_bytes
    regexp::parser::tests::test_parse_negated_quote_class
    regexp::parser::tests::test_parse_negated_slash_class
    regexp::parser::tests::test_parse_negated_unicode_class_no_ascii_bytes
    regexp::parser::tests::test_parse_non_negated_class_no_ascii_bytes
    regexp::parser::tests::test_wb_dot_star_expansion
    regexp::parser::tests::test_wb_impossible_boundary_empty_tree
    regexp::parser::tests::test_wb_middle_boundary_expansion

test result: FAILED. 506 passed; 146 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.14s

*** result: Failure(101)
