*** src/regexp/parser.rs:88:24: replace == with != in QuantifiedAtom::is_singleton

*** mutation diff:
--- src/regexp/parser.rs
+++ replace == with != in QuantifiedAtom::is_singleton
@@ -80,17 +80,17 @@
         }
     }
 }
 
 impl QuantifiedAtom {
     /// Returns true if this atom matches exactly once (no quantifier).
     #[inline]
     pub fn is_singleton(&self) -> bool {
-        self.quant_min == 1 && self.quant_max == 1
+        self.quant_min != /* ~ changed by cargo-mutants ~ */ 1 && self.quant_max == 1
     }
 
     /// Returns true if this atom is optional (?).
     #[inline]
     pub fn is_qm(&self) -> bool {
         self.quant_min == 0 && self.quant_max == 1
     }

*** result: Success
