*** src/regexp/parser.rs:88:29: replace && with || in QuantifiedAtom::is_singleton

*** mutation diff:
--- src/regexp/parser.rs
+++ replace && with || in QuantifiedAtom::is_singleton
@@ -80,17 +80,17 @@
         }
     }
 }
 
 impl QuantifiedAtom {
     /// Returns true if this atom matches exactly once (no quantifier).
     #[inline]
     pub fn is_singleton(&self) -> bool {
-        self.quant_min == 1 && self.quant_max == 1
+        self.quant_min == 1 || /* ~ changed by cargo-mutants ~ */ self.quant_max == 1
     }
 
     /// Returns true if this atom is optional (?).
     #[inline]
     pub fn is_qm(&self) -> bool {
         self.quant_min == 0 && self.quant_max == 1
     }

---- tests_operators::test_wb_plus_quantifier stdout ----

thread 'tests_operators::test_wb_plus_quantifier' (3369850) panicked at src/tests_operators.rs:1157:5:
Expected "test" in matches for {"v": "aaa "}, got []

---- tests_operators::test_wb_range_quantifier stdout ----

thread 'tests_operators::test_wb_range_quantifier' (3369851) panicked at src/tests_operators.rs:1176:5:
Expected "test" in matches for {"v": "aaaa "}, got []

---- tests_operators::test_regexp_validity stdout ----

thread 'tests_operators::test_regexp_validity' (3369817) panicked at src/tests_operators.rs:2753:5:
Found 8 regexp validation problems (expected <= 4)

failures:
    tests_operators::test_regexp_validity
    tests_operators::test_wb_plus_quantifier
    tests_operators::test_wb_range_quantifier

test result: FAILED. 649 passed; 3 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.21s

*** result: Failure(101)
