*** src/regexp/parser.rs:88:9: replace QuantifiedAtom::is_singleton -> bool with true

*** mutation diff:
--- src/regexp/parser.rs
+++ replace QuantifiedAtom::is_singleton -> bool with true
@@ -80,17 +80,17 @@
         }
     }
 }
 
 impl QuantifiedAtom {
     /// Returns true if this atom matches exactly once (no quantifier).
     #[inline]
     pub fn is_singleton(&self) -> bool {
-        self.quant_min == 1 && self.quant_max == 1
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns true if this atom is optional (?).
     #[inline]
     pub fn is_qm(&self) -> bool {
         self.quant_min == 0 && self.quant_max == 1
     }

---- regexp::parser::tests::test_wb_dot_star_expansion stdout ----

thread 'regexp::parser::tests::test_wb_dot_star_expansion' (3360754) panicked at src/regexp/parser.rs:2192:9:
assertion `left == right` failed
  left: 1
 right: 2

---- regexp::tests::test_multi_char_escape_with_quantifier stdout ----

thread 'regexp::tests::test_multi_char_escape_with_quantifier' (3360765) panicked at src/regexp/mod.rs:2247:9:
a~s{0,3}b should match 'ab'

---- regexp::tests::test_nfa_range_bounded stdout ----

thread 'regexp::tests::test_nfa_range_bounded' (3360776) panicked at src/regexp/mod.rs:577:9:
Pattern a{2,4} should NOT match 'a'

failures:
    regexp::parser::tests::test_wb_dot_star_expansion
    regexp::tests::test_multi_char_escape_with_quantifier
    regexp::tests::test_nfa_range_bounded
    regexp::tests::test_nfa_range_exact
    regexp::tests::test_nfa_range_with_class
    regexp::tests::test_nfa_range_zero_min
    regexp::tests::test_range_quantifier_exact_zero
    regexp::tests::test_range_quantifier_larger_values
    regexp::tests::test_range_quantifier_with_dot
    regexp::tests::test_range_quantifier_with_group
    regexp::tests::test_zero_quantifier
    tests_operators::test_regex_match

test result: FAILED. 633 passed; 19 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.19s

*** result: Failure(101)
