*** src/regexp/parser.rs:88:9: replace QuantifiedAtom::is_singleton -> bool with false

*** mutation diff:
--- src/regexp/parser.rs
+++ replace QuantifiedAtom::is_singleton -> bool with false
@@ -80,17 +80,17 @@
         }
     }
 }
 
 impl QuantifiedAtom {
     /// Returns true if this atom matches exactly once (no quantifier).
     #[inline]
     pub fn is_singleton(&self) -> bool {
-        self.quant_min == 1 && self.quant_max == 1
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns true if this atom is optional (?).
     #[inline]
     pub fn is_qm(&self) -> bool {
         self.quant_min == 0 && self.quant_max == 1
     }

*** result: Success
