*** src/regexp/parser.rs:94:24: replace == with != in QuantifiedAtom::is_qm

*** mutation diff:
--- src/regexp/parser.rs
+++ replace == with != in QuantifiedAtom::is_qm
@@ -86,17 +86,17 @@
     #[inline]
     pub fn is_singleton(&self) -> bool {
         self.quant_min == 1 && self.quant_max == 1
     }
 
     /// Returns true if this atom is optional (?).
     #[inline]
     pub fn is_qm(&self) -> bool {
-        self.quant_min == 0 && self.quant_max == 1
+        self.quant_min != /* ~ changed by cargo-mutants ~ */ 0 && self.quant_max == 1
     }
 
     /// Returns true if this atom uses + (one or more).
     #[inline]
     pub fn is_plus(&self) -> bool {
         self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }

---- regexp::tests::test_parse_lazy_quantifiers stdout ----

thread 'regexp::tests::test_parse_lazy_quantifiers' (3395304) panicked at src/regexp/mod.rs:194:9:
Should be optional quantifier

---- regexp::tests::test_range_quantifier_exact_one stdout ----

thread 'regexp::tests::test_range_quantifier_exact_one' (3395321) panicked at src/regexp/mod.rs:1683:13:
assertion `left == right` failed: a{1} should NOT match 'empty'
  left: true
 right: false

---- regexp::tests::test_range_quantifier_with_group stdout ----

thread 'regexp::tests::test_range_quantifier_with_group' (3395326) panicked at src/regexp/mod.rs:1857:13:
assertion `left == right` failed: (ab){2,3} should NOT match 'empty'
  left: true
 right: false

failures:
    regexp::tests::test_parse_lazy_quantifiers
    regexp::tests::test_range_quantifier_exact_one
    regexp::tests::test_range_quantifier_with_group
    tests_core::test_arena_stats_workloads
    tests_operators::test_lookaround_primary_match
    tests_operators::test_regex_various_patterns
    tests_operators::test_regexp_end2end
    tests_operators::test_regexp_validity
    tests_operators::test_wb_range_quantifier
    tests_operators::test_wb_whole_word_no_match
    tests_stress::test_pathological_correctness
    tests_stress::test_pathological_correctness_miri_friendly

test result: FAILED. 640 passed; 12 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.17s

*** result: Failure(101)
