*** src/regexp/parser.rs:94:29: replace && with || in QuantifiedAtom::is_qm

*** mutation diff:
--- src/regexp/parser.rs
+++ replace && with || in QuantifiedAtom::is_qm
@@ -86,17 +86,17 @@
     #[inline]
     pub fn is_singleton(&self) -> bool {
         self.quant_min == 1 && self.quant_max == 1
     }
 
     /// Returns true if this atom is optional (?).
     #[inline]
     pub fn is_qm(&self) -> bool {
-        self.quant_min == 0 && self.quant_max == 1
+        self.quant_min == 0 || /* ~ changed by cargo-mutants ~ */ self.quant_max == 1
     }
 
     /// Returns true if this atom uses + (one or more).
     #[inline]
     pub fn is_plus(&self) -> bool {
         self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }

---- regexp::tests::test_multi_char_escape_with_quantifier stdout ----

thread 'regexp::tests::test_multi_char_escape_with_quantifier' (3391427) panicked at src/regexp/mod.rs:2258:9:
a~s{0,3}b should match 'a  b'

---- regexp::tests::test_nfa_range_zero_min stdout ----

thread 'regexp::tests::test_nfa_range_zero_min' (3391441) panicked at src/regexp/mod.rs:735:9:
Pattern a{0,2} should match 'aa'

---- regexp::tests::test_range_quantifier_exact_one stdout ----

thread 'regexp::tests::test_range_quantifier_exact_one' (3391478) panicked at src/regexp/mod.rs:1683:13:
assertion `left == right` failed: a{1} should NOT match 'empty'
  left: true
 right: false

failures:
    regexp::tests::test_multi_char_escape_with_quantifier
    regexp::tests::test_nfa_range_zero_min
    regexp::tests::test_range_quantifier_exact_one
    regexp::tests::test_range_quantifier_exact_zero
    regexp::tests::test_range_quantifier_with_group
    regexp::tests::test_zero_quantifier
    tests_core::test_arena_stats_workloads
    tests_operators::test_lookaround_primary_match
    tests_operators::test_regex_various_patterns
    tests_operators::test_regexp_end2end
    tests_operators::test_regexp_validity
    tests_operators::test_wb_range_quantifier

test result: FAILED. 637 passed; 15 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.14s

*** result: Failure(101)
