*** src/regexp/parser.rs:94:47: replace == with != in QuantifiedAtom::is_qm

*** mutation diff:
--- src/regexp/parser.rs
+++ replace == with != in QuantifiedAtom::is_qm
@@ -86,17 +86,17 @@
     #[inline]
     pub fn is_singleton(&self) -> bool {
         self.quant_min == 1 && self.quant_max == 1
     }
 
     /// Returns true if this atom is optional (?).
     #[inline]
     pub fn is_qm(&self) -> bool {
-        self.quant_min == 0 && self.quant_max == 1
+        self.quant_min == 0 && self.quant_max != /* ~ changed by cargo-mutants ~ */ 1
     }
 
     /// Returns true if this atom uses + (one or more).
     #[inline]
     pub fn is_plus(&self) -> bool {
         self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }

---- regexp::tests::test_multi_char_escape_with_quantifier stdout ----

thread 'regexp::tests::test_multi_char_escape_with_quantifier' (3399142) panicked at src/regexp/mod.rs:2258:9:
a~s{0,3}b should match 'a  b'

---- regexp::tests::test_nfa_range_zero_min stdout ----

thread 'regexp::tests::test_nfa_range_zero_min' (3399156) panicked at src/regexp/mod.rs:735:9:
Pattern a{0,2} should match 'aa'

---- regexp::tests::test_parse_lazy_quantifiers stdout ----

thread 'regexp::tests::test_parse_lazy_quantifiers' (3399176) panicked at src/regexp/mod.rs:194:9:
Should be optional quantifier

failures:
    regexp::tests::test_multi_char_escape_with_quantifier
    regexp::tests::test_nfa_range_zero_min
    regexp::tests::test_parse_lazy_quantifiers
    regexp::tests::test_range_quantifier_exact_zero
    regexp::tests::test_zero_quantifier
    tests_operators::test_regexp_validity

test result: FAILED. 646 passed; 6 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.20s

*** result: Failure(101)
