*** src/regexp/parser.rs:94:9: replace QuantifiedAtom::is_qm -> bool with true

*** mutation diff:
--- src/regexp/parser.rs
+++ replace QuantifiedAtom::is_qm -> bool with true
@@ -86,17 +86,17 @@
     #[inline]
     pub fn is_singleton(&self) -> bool {
         self.quant_min == 1 && self.quant_max == 1
     }
 
     /// Returns true if this atom is optional (?).
     #[inline]
     pub fn is_qm(&self) -> bool {
-        self.quant_min == 0 && self.quant_max == 1
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns true if this atom uses + (one or more).
     #[inline]
     pub fn is_plus(&self) -> bool {
         self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }

---- regexp::tests::test_multi_char_escape_with_quantifier stdout ----

thread 'regexp::tests::test_multi_char_escape_with_quantifier' (3383642) panicked at src/regexp/mod.rs:2258:9:
a~s{0,3}b should match 'a  b'

---- regexp::tests::test_nfa_range_bounded stdout ----

thread 'regexp::tests::test_nfa_range_bounded' (3383653) panicked at src/regexp/mod.rs:577:9:
Pattern a{2,4} should NOT match 'a'

---- regexp::tests::test_nfa_range_zero_min stdout ----

thread 'regexp::tests::test_nfa_range_zero_min' (3383656) panicked at src/regexp/mod.rs:735:9:
Pattern a{0,2} should match 'aa'

failures:
    regexp::tests::test_multi_char_escape_with_quantifier
    regexp::tests::test_nfa_range_bounded
    regexp::tests::test_nfa_range_exact
    regexp::tests::test_nfa_range_with_class
    regexp::tests::test_nfa_range_zero_min
    regexp::tests::test_range_quantifier_exact_one
    regexp::tests::test_range_quantifier_exact_zero
    regexp::tests::test_range_quantifier_larger_values
    regexp::tests::test_range_quantifier_with_dot
    regexp::tests::test_range_quantifier_with_group
    regexp::tests::test_zero_quantifier
    tests_core::test_arena_stats_workloads

test result: FAILED. 631 passed; 21 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.10s

*** result: Failure(101)
