*** src/regexp/parser.rs:94:9: replace QuantifiedAtom::is_qm -> bool with false

*** mutation diff:
--- src/regexp/parser.rs
+++ replace QuantifiedAtom::is_qm -> bool with false
@@ -86,17 +86,17 @@
     #[inline]
     pub fn is_singleton(&self) -> bool {
         self.quant_min == 1 && self.quant_max == 1
     }
 
     /// Returns true if this atom is optional (?).
     #[inline]
     pub fn is_qm(&self) -> bool {
-        self.quant_min == 0 && self.quant_max == 1
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns true if this atom uses + (one or more).
     #[inline]
     pub fn is_plus(&self) -> bool {
         self.quant_min == 1 && self.quant_max == REGEXP_QUANTIFIER_MAX
     }

---- regexp::tests::test_parse_lazy_quantifiers stdout ----

thread 'regexp::tests::test_parse_lazy_quantifiers' (3387560) panicked at src/regexp/mod.rs:194:9:
Should be optional quantifier

failures:
    regexp::tests::test_parse_lazy_quantifiers

test result: FAILED. 651 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.17s

*** result: Failure(101)
