*** src/automaton/thread_safe.rs:1004:12: delete ! in FrozenMatchSet<X>::add

*** mutation diff:
--- src/automaton/thread_safe.rs
+++ delete ! in FrozenMatchSet<X>::add
@@ -996,17 +996,17 @@
 impl<X: Clone + Eq> FrozenMatchSet<X> {
     fn new() -> Self {
         Self {
             matches: Vec::new(),
         }
     }
 
     fn add(&mut self, x: X) {
-        if !self.matches.contains(&x) {
+        if  /* ~ changed by cargo-mutants ~ */self.matches.contains(&x) {
             self.matches.push(x);
         }
     }
 
     fn into_vec(self) -> Vec<X> {
         self.matches
     }
 }

---- automaton::tests::test_thread_safe_core_matcher_exists_false stdout ----

thread 'automaton::tests::test_thread_safe_core_matcher_exists_false' (132092) panicked at src/automaton/tests.rs:488:5:
assertion `left == right` failed: exists:false should match when field is absent
  left: 0
 right: 1

---- automaton::tests::test_thread_safe_core_matcher_single_field stdout ----

thread 'automaton::tests::test_thread_safe_core_matcher_single_field' (132097) panicked at src/automaton/tests.rs:419:5:
assertion `left == right` failed
  left: 0
 right: 1

---- automaton::thread_safe::tests::test_thread_safe_core_matcher_basic stdout ----

thread 'automaton::thread_safe::tests::test_thread_safe_core_matcher_basic' (132098) panicked at src/automaton/thread_safe.rs:1164:9:
assertion `left == right` failed
  left: []
 right: ["p1"]

failures:
    automaton::tests::test_thread_safe_core_matcher_exists_false
    automaton::tests::test_thread_safe_core_matcher_exists_true
    automaton::tests::test_thread_safe_core_matcher_multiple_patterns
    automaton::tests::test_thread_safe_core_matcher_single_field
    automaton::thread_safe::tests::test_thread_safe_core_matcher_basic
    tests_core::test_and_across_fields
    tests_core::test_arena_stats_workloads
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_array_element_matching
    tests_core::test_auto_rebuild_disabled
    tests_core::test_boolean_match
    tests_core::test_builder_combined_options

test result: FAILED. 389 passed; 203 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.55s

*** result: Failure(101)
