*** src/automaton/thread_safe.rs:1004:9: replace FrozenMatchSet<X>::add with ()

*** mutation diff:
--- src/automaton/thread_safe.rs
+++ replace FrozenMatchSet<X>::add with ()
@@ -996,19 +996,17 @@
 impl<X: Clone + Eq> FrozenMatchSet<X> {
     fn new() -> Self {
         Self {
             matches: Vec::new(),
         }
     }
 
     fn add(&mut self, x: X) {
-        if !self.matches.contains(&x) {
-            self.matches.push(x);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn into_vec(self) -> Vec<X> {
         self.matches
     }
 }
 
 /// A working value matcher that uses automata for matching

---- automaton::tests::test_thread_safe_core_matcher_exists_false stdout ----

thread 'automaton::tests::test_thread_safe_core_matcher_exists_false' (127064) panicked at src/automaton/tests.rs:488:5:
assertion `left == right` failed: exists:false should match when field is absent
  left: 0
 right: 1

---- automaton::tests::test_thread_safe_core_matcher_exists_true stdout ----

thread 'automaton::tests::test_thread_safe_core_matcher_exists_true' (127065) panicked at src/automaton/tests.rs:463:5:
assertion `left == right` failed: exists:true should match when field exists
  left: 0
 right: 1

---- automaton::tests::test_thread_safe_core_matcher_multiple_patterns stdout ----

thread 'automaton::tests::test_thread_safe_core_matcher_multiple_patterns' (127066) panicked at src/automaton/tests.rs:527:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    automaton::tests::test_thread_safe_core_matcher_exists_false
    automaton::tests::test_thread_safe_core_matcher_exists_true
    automaton::tests::test_thread_safe_core_matcher_multiple_patterns
    automaton::tests::test_thread_safe_core_matcher_single_field
    automaton::thread_safe::tests::test_thread_safe_core_matcher_basic
    tests_core::test_and_across_fields
    tests_core::test_arena_stats_workloads
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_array_element_matching
    tests_core::test_auto_rebuild_disabled
    tests_core::test_boolean_match
    tests_core::test_builder_combined_options

test result: FAILED. 389 passed; 203 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.17s

*** result: Failure(101)
