*** src/automaton/thread_safe.rs:869:9: replace ThreadSafeCoreMatcher<X>::check_exists_false_ref with ()

*** mutation diff:
--- src/automaton/thread_safe.rs
+++ replace ThreadSafeCoreMatcher<X>::check_exists_false_ref with ()
@@ -861,28 +861,17 @@
     fn check_exists_false_ref(
         &self,
         state: &Arc<FrozenFieldMatcher<X>>,
         fields: &[EventFieldRef<'_>],
         index: usize,
         matches: &mut FrozenMatchSet<X>,
         bufs: &mut NfaBuffers,
     ) {
-        for (path, exists_trans) in &state.exists_false {
-            let field_exists = fields
-                .binary_search_by(|f| f.path.cmp(path.as_str()))
-                .is_ok();
-
-            if !field_exists {
-                for m in &exists_trans.matches {
-                    matches.add(m.clone());
-                }
-                self.try_to_match_ref(fields, index, exists_trans, matches, bufs);
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Match fields using flattened fields directly.
     ///
     /// This avoids the intermediate EventFieldRef allocation by working
     /// directly with flatten_json::Field. Fields should already be sorted by path.
     /// Can be called concurrently from multiple threads. Lock-free in steady state;
     /// briefly acquires the build lock on the first call after pattern additions.

*** result: Success
