*** src/automaton/thread_safe.rs:93:5: replace no_array_trail_conflict_ref -> bool with true

*** mutation diff:
--- src/automaton/thread_safe.rs
+++ replace no_array_trail_conflict_ref -> bool with true
@@ -85,24 +85,17 @@
     }
 }
 
 /// Check if two array trails have no conflicts (using flatten_json::ArrayPos)
 fn no_array_trail_conflict_ref(
     from: &[crate::flatten_json::ArrayPos],
     to: &[crate::flatten_json::ArrayPos],
 ) -> bool {
-    for from_pos in from {
-        for to_pos in to {
-            if from_pos.array == to_pos.array && from_pos.pos != to_pos.pos {
-                return false;
-            }
-        }
-    }
-    true
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Check if two array trails have no conflicts
 fn no_array_trail_conflict(from: &[crate::json::ArrayPos], to: &[crate::json::ArrayPos]) -> bool {
     for from_pos in from {
         for to_pos in to {
             if from_pos.array == to_pos.array && from_pos.pos != to_pos.pos {
                 return false;

---- tests_core::test_array_cross_element_matching stdout ----

thread 'tests_core::test_array_cross_element_matching' (57230) panicked at src/tests_core.rs:193:5:
Should not match across different array elements (event: {"members": [
        {"given": "Joe", "surname": "Strummer"},
        {"given": "Mick", "surname": "Jones"}
    ]})

---- tests_core::test_array_cross_element_comprehensive stdout ----

thread 'tests_core::test_array_cross_element_comprehensive' (57229) panicked at src/tests_core.rs:230:5:
assertion `left == right` failed: Expected 1 matches for {
        "bands": [
            {
                "name": "The Clash",
                "members": [
                    {"given": "Joe", "surname": "Strummer", "role": ["guitar", "vocals"]},
                    {"given": "Mick", "surname": "Jones", "role": ["guitar", "vocals"]},
                    {"given": "Paul", "surname": "Simonon", "role": ["bass"]},
                    {"given": "Topper", "surname": "Headon", "role": ["drums"]}
                ]
            },

failures:
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_array_cross_element_matching

test result: FAILED. 590 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.63s

*** result: Failure(101)
