*** src/automaton/thread_safe.rs:93:5: replace no_array_trail_conflict_ref -> bool with false

*** mutation diff:
--- src/automaton/thread_safe.rs
+++ replace no_array_trail_conflict_ref -> bool with false
@@ -85,24 +85,17 @@
     }
 }
 
 /// Check if two array trails have no conflicts (using flatten_json::ArrayPos)
 fn no_array_trail_conflict_ref(
     from: &[crate::flatten_json::ArrayPos],
     to: &[crate::flatten_json::ArrayPos],
 ) -> bool {
-    for from_pos in from {
-        for to_pos in to {
-            if from_pos.array == to_pos.array && from_pos.pos != to_pos.pos {
-                return false;
-            }
-        }
-    }
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Check if two array trails have no conflicts
 fn no_array_trail_conflict(from: &[crate::json::ArrayPos], to: &[crate::json::ArrayPos]) -> bool {
     for from_pos in from {
         for to_pos in to {
             if from_pos.array == to_pos.array && from_pos.pos != to_pos.pos {
                 return false;

---- tests_core::test_and_across_fields stdout ----

thread 'tests_core::test_and_across_fields' (66321) panicked at src/tests_core.rs:272:5:
assertion `left == right` failed: Event: {"type": "order", "status": "pending", "priority": "high"}
  left: []
 right: ["p1"]

---- tests_core::test_array_cross_element_comprehensive stdout ----

thread 'tests_core::test_array_cross_element_comprehensive' (66328) panicked at src/tests_core.rs:230:5:
assertion `left == right` failed: Expected 1 matches for {
        "bands": [
            {
                "name": "The Clash",
                "members": [
                    {"given": "Joe", "surname": "Strummer", "role": ["guitar", "vocals"]},
                    {"given": "Mick", "surname": "Jones", "role": ["guitar", "vocals"]},
                    {"given": "Paul", "surname": "Simonon", "role": ["bass"]},
                    {"given": "Topper", "surname": "Headon", "role": ["drums"]}
                ]
            },

---- tests_core::test_mixed_number_and_string_in_same_value_array stdout ----

thread 'tests_core::test_mixed_number_and_string_in_same_value_array' (66391) panicked at src/tests_core.rs:1442:5:
assertion `left == right` failed: String '3' should match the string literal in [1, "3"] (event: {"a": 1, "b": "3"})
  left: []
 right: ["p1"]

failures:
    tests_core::test_and_across_fields
    tests_core::test_array_cross_element_comprehensive
    tests_core::test_mixed_number_and_string_in_same_value_array
    tests_operators::test_nested_transmap_safety
    tests_operators::test_nested_transmap_safety_miri_friendly
    tests_operators::test_overlapping_shellstyle_nesting
    tests_operators::test_overlapping_shellstyle_nesting_miri_friendly
    tests_operators::test_three_level_nesting
    tests_operators::test_three_level_nesting_miri_friendly
    tests_stress::test_exercise_matching_comprehensive

test result: FAILED. 582 passed; 10 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.43s

*** result: Failure(101)
