*** src/automaton/thread_safe.rs:95:47: replace && with || in no_array_trail_conflict_ref

*** mutation diff:
--- src/automaton/thread_safe.rs
+++ replace && with || in no_array_trail_conflict_ref
@@ -87,17 +87,17 @@
 
 /// Check if two array trails have no conflicts (using flatten_json::ArrayPos)
 fn no_array_trail_conflict_ref(
     from: &[crate::flatten_json::ArrayPos],
     to: &[crate::flatten_json::ArrayPos],
 ) -> bool {
     for from_pos in from {
         for to_pos in to {
-            if from_pos.array == to_pos.array && from_pos.pos != to_pos.pos {
+            if from_pos.array == to_pos.array || /* ~ changed by cargo-mutants ~ */ from_pos.pos != to_pos.pos {
                 return false;
             }
         }
     }
     true
 }
 
 /// Check if two array trails have no conflicts

---- tests_core::test_array_cross_element_comprehensive stdout ----

thread 'tests_core::test_array_cross_element_comprehensive' (64654) panicked at src/tests_core.rs:230:5:
assertion `left == right` failed: Expected 1 matches for {
        "bands": [
            {
                "name": "The Clash",
                "members": [
                    {"given": "Joe", "surname": "Strummer", "role": ["guitar", "vocals"]},
                    {"given": "Mick", "surname": "Jones", "role": ["guitar", "vocals"]},
                    {"given": "Paul", "surname": "Simonon", "role": ["bass"]},
                    {"given": "Topper", "surname": "Headon", "role": ["drums"]}
                ]
            },

failures:
    tests_core::test_array_cross_element_comprehensive

test result: FAILED. 591 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.65s

*** result: Failure(101)
