*** src/automaton/thread_safe.rs:966:9: replace ThreadSafeCoreMatcher<X>::check_exists_false_direct with ()

*** mutation diff:
--- src/automaton/thread_safe.rs
+++ replace ThreadSafeCoreMatcher<X>::check_exists_false_direct with ()
@@ -958,28 +958,17 @@
     fn check_exists_false_direct(
         &self,
         state: &Arc<FrozenFieldMatcher<X>>,
         fields: &[crate::flatten_json::Field<'_>],
         index: usize,
         matches: &mut FrozenMatchSet<X>,
         bufs: &mut NfaBuffers,
     ) {
-        for (path, exists_trans) in &state.exists_false {
-            let field_exists = fields
-                .binary_search_by(|f| f.path.as_ref().cmp(path.as_bytes()))
-                .is_ok();
-
-            if !field_exists {
-                for m in &exists_trans.matches {
-                    matches.add(m.clone());
-                }
-                self.try_to_match_direct(fields, index, exists_trans, matches, bufs);
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<X: Clone + Eq + Hash + Send + Sync> Default for ThreadSafeCoreMatcher<X> {
     fn default() -> Self {
         Self::new()
     }
 }

---- tests_core::test_field_name_ordering_with_exists stdout ----

thread 'tests_core::test_field_name_ordering_with_exists' (120341) panicked at src/tests_core.rs:1064:5:
assertion `left == right` failed: Expected 4 matches for {"b": 1}, got ["p2"]
  left: 1
 right: 4

---- tests_stress::test_exercise_matching_comprehensive stdout ----

thread 'tests_stress::test_exercise_matching_comprehensive' (120568) panicked at src/tests_stress.rs:890:5:
assertion `left == right` failed: All should_match patterns should match when combined: expected 16 matches for {
        "Image": {
            "Width":  800,
            "Height": 600,
            "Title":  "View from 15th Floor",
            "Thumbnail": {
                "Url":    "https://www.example.com/image/481989943",
                "Height": 125,
                "Width":  100
            },
            "Animated" : false,

failures:
    tests_core::test_field_name_ordering_with_exists
    tests_stress::test_exercise_matching_comprehensive

test result: FAILED. 590 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 7.11s

*** result: Failure(101)
